{
  "solutionId": "365akademie-microsoft365champions",
  "partnerId": "365-akademie",
  "categories": [
    "learningpathways"
  ],
  "industries": [
    "Cross-Industry"
  ],
  "servicesUsed": [
    "Microsoft Teams",
    "SharePoint sites",
    "SPFx"
  ],
  "sortOrder": 0,
  "preview": false,
  "visible": false,
  "solutionLogoPicture": null,
  "solutionLogoPictureAlt": "",
  "solutionName": "Microsoft 365 Champions – Modern Workplace Community",
  "solutionUrl": "https://www.365akademie.de/champions-community/",
  "solutionUrlTitle": "Microsoft 365 Champions – Modern Workplace Community",
  "metadata": {
    "personas": "Microsoft 365 User",
    "businessFunctions": null,
    "businessValue": "The integration of the learning videos into Microsoft Teams drives Adoption and helps your organization to achieve more. \u0026nbsp;\n\u003Cbr\u003E \n\u003Cbr\u003E\n\u003Cbr\u003E \n\u003Cbr\u003EThe usage of all the Microsoft 365 Apps increases. Social learning helps users to learn self-organized. This reduces the technical support and gives more room for innovation.",
    "displayPartner": false,
    "appSource": null,
    "displayInfo": {
      "default": {
        "descriptionParagraphs": [
          {
            "name": "Short description",
            "content": [
              "Create an organization wide Microsoft 365 Champions – Modern Workplace Community and keep all of your employees informed."
            ]
          },
          {
            "name": "Long description",
            "content": []
          },
          {
            "name": "Business need or problem",
            "content": [
              "There are a lot of sources for information regarding Microsoft 365. But how do the users know about the right ones for their specific job and the Microsoft 365 environment at your organization. Microsoft 365 looks different in different organizations. \u0026nbsp;\u0026nbsp;\n\u003Cbr\u003E\n\u003Cbr\u003E \n\u003Cbr\u003E \n\u003Cbr\u003EUsers are overwhelmed with all the digital tools and features Microsoft 365 provides. They do not welcome change and stick to their “business as usual”. The users must be informed of the changes, new features and the benefits. \u0026nbsp;\n\u003Cbr\u003E \n\u003Cbr\u003E\n\u003Cbr\u003E \n\u003Cbr\u003EThe users do not like to ask how you use the digital tools or on the other hand overrun the technical support with the same questions."
            ]
          },
          {
            "name": "Business solution",
            "content": [
              "The 365 Akademie helps you create a place for social learning in Microsoft Teams and supports your Microsoft 365 Champions – Modern Workplace Community with insights and impulses on how to use the new features. The short and easy to follow videos are perfect for Teams posts and drive the communication."
            ]
          },
          {
            "name": "Success factors",
            "content": [
              "The support of management and other key stakeholders and a communication strategy are the two main aspects of a successful implementation. The 365 Akademie supports you with its expertise and gives insights and impulses."
            ]
          }
        ],
        "mediaAssets": [
          {
            "type": "image",
            "order": 0,
            "url": "assets/Microsoft 365 Champions 2.png",
            "alt": ""
          },
          {
            "type": "image",
            "order": 1,
            "url": "assets/Microsoft 365 Champions 1.png",
            "alt": ""
          }
        ],
        "detailItemCategories": [
          {
            "name": "Resources",
            "description": "Possible html supported text shown just above the list of links",
            "items": [
              {
                "url": "https://www.365akademie.de/",
                "name": "Office 365 Akademie - Produktiver Arbeiten mit Office 365"
              }
            ]
          }
        ]
      }
    }
  }
}