{
    "solutionId": "valo-teamwork",
    "categories": [
        "SOLUTION-CATEGORY01", "SOLUTION-CATEGORY03"
    ],
    "industries": [
        "Cross Industry"
    ],
    "sortOrder": 100,
    "preview": true,
    "visible": false,
    "solutionLogoPicture": "/assets/reach-logo.png",
    "solutionLogoPictureAlt": "Reach",
    "solutionName": "Reach",
    "solutionUrl": "https://livetilesglobal.com/products/livetiles-reach/",
    "solutionUrlTitle": "LiveTiles Reach",
    "metadata": {
        "displayInfo": {
            "default": {
                "descriptionParagraphs": [
                    {
                        "name": "Short Description",
                        "content": [
                            "Teamwork is the one place to gather together all the places you need in all your daily work. It is accessible from any device, through browser or any Microsoft application (incl. Microsoft Teams). It provides provisioning, navigation, governance, lifecycle management and search for all your workplaces."
                        ]
                    },
                    {
                        "name": "Business need or problem",
                        "content": [
                            "The creation of Microsoft Teams, Microsoft 365 groups, Yammer Groups and SharePoint sites (classic and modern) is already possible in Microsoft 365. However, the creation experience is available from different places and in many cases, there is limited or very basic support for creating workspaces based on templates, applying governance rules, and managing the lifecycle. Moreover, there is no area in Microsoft 365 OOTB where customers can search for all workspaces and refine the results by enterprise metadata, different template types and display name."
                        ]
                    },
                    {
                        "name": "Business solution",
                        "content": [
                            "Valo Teamwork is a collaboration solution that can be used to create Microsoft Teams, Microsoft 365 groups, Yammer Groups and SharePoint sites (classic and modern). The creation process supports customizable templates that power users and administrators can create based on their business needs. All templates support governance, lifecycle management and provisioning features. Here a list of some important functionalities that can be configured at template level:
•	Governance:
•	naming policies (different rules for URL and display name. It supports suffix, prefix and banned words), 
•	membership settings (default owners/members and minimum number of owners/members), 
•	privacy settings (sensitivity labels, external sharing etc.), 
•	terms and conditions (creation of teams only supported if user will accept the terms and conditions)
•	limit access to templates to specific users
•	Provisioning
•	PnP support
•	Site Designs support
•	Enterprise Metadata
•	Planner templates (buckets and tasks)
•	Teams (Icon, Settings, Apps, Channels, Tabs [preconfigured tabs] and chat messages)
•	Lifecycle
•	Enable/Disable approval for all templates
•	Power Automate support (Build complex workflows for approval)
•	Guided steps to create a team based on a template
•	Manual archiving after workspace creation
•	Auto-Archiving (Coming soon)
End-Users can create workspaces based on pre-defined templates. This is possible through an innovative, self-explanatory, and modern request form. After creation, users can search for their workspaces using a dashboard which supports searching for display name as well as filtering by enterprise metadata and template type. Everything is accessible from Microsoft Teams via a personal app or from SharePoint using a SPFx web part.
"
                        ]
                    }                                       
                ],
                "mediaAssets": [
                    {
                        "type": "image",
                        "order": 100,
                        "url": "/assets/promo-bot.png",
                        "alt": "Alt text for the image"
                    },
                    {
                        "type": "video",
                        "order": 101,
                        "url": "https://youtube.com/embed/3120470",
                        "alt": "Alt text for the video"
                    }
                ],
                "detailItemCategories": [
                    {
                        "name": "Technologies",
                        "description": "Possible html supported text shown just above the list of links",
                        "items": [
                            {
                                "name": "Bot - link to extensibility look book",
                                "url": "http://aka.ms/m365pnp"
                            },
                            {
                                "name": "SharePoint Framework - link to extensibility look book",
                                "url": "http://aka.ms/m365pnp"
                            }
                        ]
                    },
                    {
                        "name": "Resources",
                        "description": "Possible html supported text shown just above the list of links",
                        "items": [
                            {
                                "name": "Here are some additional references"
                            },
                            {
                                "name": "Additional link",
                                "url": "http://aka.ms/m365pnp"
                            },
                            {
                                "name": "Second additional link",
                                "url": "http://aka.ms/m365pnp"
                            }
                        ]
                    }
                ]
            }
        },
        "fi": {
            "descriptionParagraphs": [
                "Tää on tosi kova tuote mitä kaikkien pitäisi käyttää!"
            ]
        }
    }
}
