{
  "solutionId": "devopstools",
  "partnerId": "cognizant",
  "categories": [
    "teams"
  ],
  "industries": [
    "Cross-Industry"
  ],
  "servicesUsed": [
    "Azure",
    "Power App",
    "Power Automate",
    "Search"
  ],
  "sortOrder": 0,
  "preview": false,
  "visible": false,
  "solutionLogoPicture": null,
  "solutionLogoPictureAlt": "",
  "solutionName": "DevOps Tools Integration with MS Teams",
  "solutionUrl": null,
  "solutionUrlTitle": "DevOps Tools Integration with MS Teams",
  "metadata": {
    "personas": "Project Manager",
    "businessFunctions": null,
    "businessValue": "Solution is well received and in Pilot phase for 1-way communication and 2-way communication is development. \n\u003Cbr\u003ESolution enabled proactive and targeted communication to the project stakeholders instead of general broadcast messages, this in turn improved responsiveness to the communication and resulted faster resolution to the issue. \n\u003Cbr\u003EProject stakeholders are able to received only the information they are intended to, and take faster action to resolve the issue, collaborate with teams without switching between multiple collaboration channels, \u0026nbsp;and act on the notification right from MS Teams.",
    "displayPartner": false,
    "appSource": null,
    "displayInfo": {
      "default": {
        "descriptionParagraphs": [
          {
            "name": "Short description",
            "content": []
          },
          {
            "name": "Long description",
            "content": []
          },
          {
            "name": "Business need or problem",
            "content": [
              "Project Managers and stakeholders (Developers, Testers, Database administrators, Infrastructure, etc) are not being notified proactively on the CI/CD pipeline failures or errors. Rather, as of today it’s a reactive approach once the entire process is completed. \n\u003Cbr\u003EExisting process is to send emails or use other communication medium to inform the project stakeholders about the success or failure of the pipeline. There is no single pane of glass experience or communication when the CI/CD process encounter any issue. \n\u003Cbr\u003EThis Solution brings in collaboration in to Ci/CD processes using Microsoft Teams and enables the project teams to handle the issues more effectively and efficiently."
            ]
          },
          {
            "name": "Business solution",
            "content": [
              "This solution integrates multiple DevOps tools to Microsoft Teams, in plug and play model and without much changes in existing DevOps tools configurations, to deliver tools messages as notifications on to Microsoft Teams platform. \n\u003Cbr\u003EThere are existing solutions for DevOps tools integration using Teams web hook capabilities, but this approach has maintenance overhead, security and customizations concerns. \n\u003Cbr\u003ESolution is implemented using Power Platform (Power Automate and Power Apps) for self-service project mapping, adaptive cards for notifications (1-way and 2-Way integration) and BOT to handle the communications. \n\u003Cbr\u003EThis solution is helping in alerting stakeholders in real time and bringing them together to resolve any issue using Teams out of the box communication and collaboration capabilities. Customized information is targeted to specific group of individuals rather than overloading with loads of information which they are not needed."
            ]
          },
          {
            "name": "Success factors",
            "content": [
              "MS Teams helped in bringing collaboration in to applications, and provided single pane of glass experience in the entire process."
            ]
          }
        ],
        "mediaAssets": [],
        "detailItemCategories": [
          {
            "name": "Resources",
            "description": "Possible html supported text shown just above the list of links",
            "items": []
          }
        ]
      }
    }
  }
}