{
  "partnerId": "valo",
  "categories": [],
  "industries": [],
  "solutions": null,
  "sortOrder": 0,
  "preview": false,
  "visible": true,
  "logoPicture": null,
  "logoPictureAlt": "",
  "heroPicture": "assets/hero.png",
  "featuredPicture": "assets/featured.png",
  "partnerName": "Valo Solutions",
  "mpnId": "1136673",
  "metadata": {
    "displayInfo": {
      "default": {
        "shortDescription": "\u003Cdiv\u003EValo are a pioneering Digital Workplace product provider which is home to many talented and influential Microsoft 365 professionals. Our solutions have been awarded with the coveted Microsoft “Partner of the Year” honor. #ValoCheers to great achievements!\u003Cbr\u003E\u003C/div\u003E",
        "featuredTitle": "Fall in love with your digital workplace!",
        "featuredParagraphs": [
          "\u003Cdiv\u003EDrive innovation with\u0026nbsp;\u003Cb\u003EValo Ideas\u003C/b\u003E. Co-create and drive innovation while having fun. With Valo Ideas your workers can present new ideas, discuss and react on them from Microsoft Teams! \u003C/div\u003E\u003Cdiv\u003E\u003Cbr\u003E\u003C/div\u003E\u003Cdiv\u003EBuild a custom enterprise portal with\u0026nbsp;\u003Cb\u003EValo Connect\u003C/b\u003E. Unite your team and tools under one roof. With Valo Connect you can communicate, collaborate and co-innovate without leaving the comfort of Microsoft Teams. \u003C/div\u003E\u003Cdiv\u003E \u003C/div\u003E",
          "\u003Cdiv\u003ETake it easy with external stakeholder access management.\u0026nbsp;\u003Cb\u003EValo Entrance\u0026nbsp;\u003C/b\u003Emakes it easy for you to share your resources by automating and streamlining many time-consuming tasks you would traditionally have when inviting and managing external user rights in your Microsoft 365 environment. \u003Cbr\u003E\u003Cbr\u003E\u003C/div\u003E\u003Cdiv\u003EAn intranet you’ll fall in love with.\u0026nbsp;\u003Cb\u003EValo Intranet\u003C/b\u003E\u0026nbsp;is the center of all internal communication and teamwork on your organization. It offers all the features your team will need – along with a beautiful user experience. \u003C/div\u003E\u003Cdiv\u003E \u003C/div\u003E",
          "\u003Cdiv\u003E\u003Cb\u003EValo Teamwork\u003C/b\u003E\u0026nbsp;brings all your collaboration tools together. Managing between multiple workspaces and tools can be exhausting. Teamwork brings everything together in one view and let’s administrators have full control of the group lifecycle.\u003Cbr\u003E\u003C/div\u003E\u003Cdiv\u003E \u003C/div\u003E"
        ],
        "callToAction": {
          "title": "Schedule a free demo today!",
          "description": "Would you like to see one of our products in action? Click on the link below to find out more about our products.",
          "url": "https://www.valointranet.com/tour/"
        },
        "mediaAssets": [
          {
            "type": "image",
            "order": 0,
            "url": "assets/Featured.png",
            "alt": ""
          },
          {
            "type": "image",
            "order": 1,
            "url": "assets/Hero.png",
            "alt": ""
          }
        ],
        "detailItemCategories": []
      }
    }
  }
}