{
  "solutionId": "companycommunicator",
  "partnerId": "cognizant",
  "categories": [
    "teams"
  ],
  "industries": [
    "Cross-Industry"
  ],
  "servicesUsed": [
    "Azure"
  ],
  "sortOrder": 0,
  "preview": false,
  "visible": false,
  "solutionLogoPicture": null,
  "solutionLogoPictureAlt": "",
  "solutionName": "Company Communicator",
  "solutionUrl": null,
  "solutionUrlTitle": "Company Communicator",
  "metadata": {
    "personas": "Corporate Communications;HR;IT;Security Admin",
    "businessFunctions": "Human Resources",
    "businessValue": "Communicationmanagers can send targeted communication, schedule communication for a givendate and time, recurring communication, and use pre-configured communicationtemplates to make it even easy to send. \n\u003Cbr\u003EThis willincrease the employee reach and response, also reduce the time taken to sendemployee targeted communications.",
    "displayPartner": false,
    "appSource": null,
    "displayInfo": {
      "default": {
        "descriptionParagraphs": [
          {
            "name": "Short description",
            "content": []
          },
          {
            "name": "Long description",
            "content": []
          },
          {
            "name": "Business need or problem",
            "content": [
              "A platformfor corporate wide communications is needed, as employees are hindered withdaily business communications and there is a chance of missing corporatecommunications in the flood of emails. A better communication channel,Microsoft Teams, will allow them to get focused communication and act on it."
            ]
          },
          {
            "name": "Business solution",
            "content": [
              "The Company Communicator customization enablescorporate teams to create, schedule and send messages intended for multipleteams or large number of employees (using DLs) over Teams Channels and personalchat allowing organization to reach employees right where they collaborate. \n\u003Cbr\u003EThis solution can be used for multiple scenarios suchas targeted communications, employee onboarding, modern learning anddevelopment or organization-wide broadcasts.\n\u003Cbr\u003EThe solution provides an easy interface fordesignated users to create, preview, collaborate, schedule and send messages.Extended custom functionality allows authors to edit and delete sent messages,also provides extended telemetry like user reactions to messages. \n\u003Cbr\u003ECustomizations also provides options to createmultiple BU specific groups and assign admins to those groups. This will allowGroup Admin to send targeted communications for the selected groups/DLs forwhich they are allowed to."
            ]
          },
          {
            "name": "Success factors",
            "content": [
              "* \u0026nbsp;Helped organization reachemployees more effectively and get their attention using their existinginvestment on Microsoft Teams platform. \n\u003Cbr\u003E * \u0026nbsp;Employees can collaborateon Teams without switching to different application to get any relatedinformation."
            ]
          }
        ],
        "mediaAssets": [],
        "detailItemCategories": [
          {
            "name": "Resources",
            "description": "Possible html supported text shown just above the list of links",
            "items": []
          }
        ]
      }
    }
  }
}