{
  "solutionId": "storyalspro",
  "partnerId": "storyals",
  "categories": [
    "learningpathways"
  ],
  "industries": [
    "Cross-Industry"
  ],
  "servicesUsed": [
    "SharePoint API",
    "SharePoint sites",
    "SPFx"
  ],
  "sortOrder": 0,
  "preview": false,
  "visible": false,
  "solutionLogoPicture": null,
  "solutionLogoPictureAlt": "",
  "solutionName": "Storyals Pro",
  "solutionUrl": "https://storyals.com/storyalspro",
  "solutionUrlTitle": "Storyals Pro",
  "metadata": {
    "personas": "Information Workers",
    "businessFunctions": null,
    "businessValue": "WithStoryals Pro organizations get powerful tools to accelerate digital adoptionand provide their employees with the digital skills they need for today’smodern workplace. Digital training at your fingertips, accessible at any time,and new insights that can be applied directly on the job. Tools to assignStoryals learning content, send gentle reminders, and reward users withpersonalized completion certificates. \n\u003Cbr\u003E\n\u003Cbr\u003ECreating confident users gets rid of unnecessaryfrustration and lowers the need for technical support. It improves productivityand - without a doubt, creates a happier workplace!",
    "displayPartner": true,
    "appSource": null,
    "displayInfo": {
      "default": {
        "descriptionParagraphs": [
          {
            "name": "Short description",
            "content": [
              "A cutting-edge learning solution to drive transformation and build digital skills."
            ]
          },
          {
            "name": "Long description",
            "content": []
          },
          {
            "name": "Business need or problem",
            "content": [
              "Users today are overwhelmed with the many modern tools that Microsoft 365 provides. It’s difficult for organizations to provide their employees with the necessary learning required for users to use these tools in an effective manner. Classroom based training, carried out a couple of times a year, is no longer sufficient to keep users trained with the constant changes and updates of today\u0027s modern tools. \n\u003Cbr\u003E\n\u003Cbr\u003EMany users are stuck in traditional ways of working and don’t always welcome change. They need to be made aware of the benefits and understand why they should change their behavior, in addition to how to use the tools to do it. \n\u003Cbr\u003E\n\u003Cbr\u003EIn addition to providing users with the necessary coaching and guidance, change management leaders need tools to assign, track and follow up on end user learning."
            ]
          },
          {
            "name": "Business solution",
            "content": [
              "Storyals Pro is designed for departmentsand organizations looking for a rich Microsoft 365 adoption solution to drive transformation and build digital skills.\n\u003Cbr\u003E\n\u003Cbr\u003EThesolution provides employees with Storyals unique story-based learning content,to inspire, motivate and educate them to work smarter with Microsoft365.\n\u003Cbr\u003E\n\u003Cbr\u003EStoryalsPro also provides your organization with LMS365 (limited to manage onlyStoryals learning content) which enable change management leaders to assign and monitor end user progress.\n\u003Cbr\u003E\n\u003Cbr\u003EStory-basedlearning content\n\u003Cbr\u003EWith Storyals Pro, users are provided with a learningsite with self-paced, high-quality training videos and story-basedtutorials. \u0026nbsp;The on-demand videosfrom Storyals focus on “what you need to know” to work effectivelyusing modern digital tools. Users have access to a selected number of learning topics, eachcovering various apps and features. All learning topics highlight digitalworkplace best practices and feature real-world scenarios and arecontinuously updated and maintained by Storyals. To furtherstrengthen understanding, each topic includes a quiz with situational-basedquestions. The solution also includes “how-to” videos from Microsoft viaMicrosoft 365 Learning Pathways. \u0026nbsp;\n\u003Cbr\u003E\n\u003Cbr\u003EWith Storyals Proyou get:\n\u003Cbr\u003E\n\u003Cbr\u003ELearningcontent: \n\u003Cbr\u003E\n\u003Cbr\u003E * \u0026nbsp;A great lookingSharePoint site\n\u003Cbr\u003E * \u0026nbsp;Access toall Storyals topics\n\u003Cbr\u003E * \u0026nbsp;Continuous video updates\n\u003Cbr\u003E * \u0026nbsp;Quizzes tostrengthen understanding\n\u003Cbr\u003E * \u0026nbsp;Personalized completioncertificates \n\u003Cbr\u003E * \u0026nbsp;Microsoft 365 LearningPathways\n\u003Cbr\u003E\n\u003Cbr\u003E\n\u003Cbr\u003EAdoptiontools: \n\u003Cbr\u003E\n\u003Cbr\u003E * \u0026nbsp;A limited version ofLMS365\n\u003Cbr\u003E * \u0026nbsp;The LMS365 Teams app\n\u003Cbr\u003E * \u0026nbsp;Anywhere access viamobile LMS365 app \n\u003Cbr\u003E\n\u003Cbr\u003E\n\u003Cbr\u003E\n\u003Cbr\u003EPersonalized dashboards\n\u003Cbr\u003E\n\u003Cbr\u003E * \u0026nbsp;Ability to assignStoryals topics to users\n\u003Cbr\u003E * \u0026nbsp;Rich learner progressreports\n\u003Cbr\u003E * \u0026nbsp;Professional supportand maintenance"
            ]
          },
          {
            "name": "Success factors",
            "content": [
              "Tosucceed with digital workplace adoption using Storyals Pro, your IT departmentor IT-hosting provider needs to be involved.\n\u003Cbr\u003E\n\u003Cbr\u003EWithStoryals Pro learning content is made available to end users via SharePoint,Teams or via a mobile app. Storyals Pro leverages a limited version of LMS365 toprovide and manage the Storyals learning content and Microsoft 365 LearningPathways to provide “how-to” videos to end users. \u0026nbsp;\n\u003Cbr\u003E\n\u003Cbr\u003EWe know that to be successful in drivingadoption and building digital skills, it is vital to have the support ofmanagement and other key stakeholders. We recommend you make a plan for how toroll out the adoption program to end-users in order to get everyone on-board.Storyals Adoption Experts are happy to help you with this."
            ]
          }
        ],
        "mediaAssets": [
          {
            "type": "image",
            "order": 0,
            "url": "assets/6.  Storyals Pro Expert guidance within Teams.png",
            "alt": ""
          },
          {
            "type": "image",
            "order": 1,
            "url": "assets/5. Storyals Pro Learning from Teams.png",
            "alt": ""
          },
          {
            "type": "image",
            "order": 2,
            "url": "assets/7.  Storyals Pro Learner progress reporting.png",
            "alt": ""
          },
          {
            "type": "image",
            "order": 3,
            "url": "assets/3. Storyals Pro learning topi.png",
            "alt": ""
          },
          {
            "type": "image",
            "order": 4,
            "url": "assets/1. Storyals Pro featured image.png",
            "alt": ""
          },
          {
            "type": "image",
            "order": 5,
            "url": "assets/2. Storyals Pro in M365.jpg",
            "alt": ""
          },
          {
            "type": "image",
            "order": 6,
            "url": "assets/4. Storyals Pro Learning topics.png",
            "alt": ""
          }
        ],
        "detailItemCategories": [
          {
            "name": "Resources",
            "description": "Possible html supported text shown just above the list of links",
            "items": [
              {
                "url": "https://storyals.com/storyalspro",
                "name": "https://storyals.com/storyalspro"
              }
            ]
          }
        ]
      }
    }
  }
}