{
  "solutionId": "learn365",
  "partnerId": "witivio",
  "categories": [
    "teams"
  ],
  "industries": [],
  "sortOrder": 0,
  "preview": false,
  "visible": false,
  "solutionLogoPicture": null,
  "solutionLogoPictureAlt": "",
  "solutionName": "Learn365",
  "solutionUrl": "https://www.witivio.com/en/office-365-adoption/",
  "solutionUrlTitle": "Learn365",
  "metadata": {
    "personas": "All Employees;Corporate Communications;HR;IT",
    "businessFunctions": null,
    "displayPartner": true,
    "appSource": null,
    "displayInfo": {
      "default": {
        "descriptionParagraphs": [
          {
            "name": "Short description",
            "content": [
              "Learn365 is a multilingual virtual assistant 100% integrated withMicrosoft Teams. It supports employees to improve their Office 365 skills byanswering all their questions 24/7."
            ]
          },
          {
            "name": "Long description",
            "content": []
          },
          {
            "name": "Business need or problem",
            "content": [
              "Learning newworking tools can be challenging for everybody—both for the team who deployed them and theemployees who use them.\n\u003Cbr\u003E\n\u003Cbr\u003ETo-do’s,deadlines, and responsibilities clutter our working hours, leaving almost notime for extras. Let alone having to figure out how the new tool works.\n\u003Cbr\u003E\n\u003Cbr\u003EWhendeploying Office 365 and Microsoft Teams, it’s crucial to support employees. The proper support willhelp them become self-sufficient users and increase Office 365 adoption whilerelieving the IT Helpdesk workload.\n\u003Cbr\u003E\n\u003Cbr\u003EThe incorrector inexistent support can bring negative and long-lasting repercussions suchas:\n\u003Cbr\u003E \n\u003Cbr\u003ELimited ROI, preventing the organization from \u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;achieving the targeted return on the investment for Office 365.\n\u003Cbr\u003E \n\u003Cbr\u003EAn overloaded Helpdesk \u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;IT Team. A high number of \u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;tickets from employees needing assistance with basic operations.\n\u003Cbr\u003E \n\u003Cbr\u003EUnhappy \u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;workforce. Frustrated employees with low confidence in their skills and who \u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;look down on the tools the company provides.\n\u003Cbr\u003E\n\u003Cbr\u003EAn Office 365Virtual assistant like Learn365 can be an ideal solution to support Office 365deployment."
            ]
          },
          {
            "name": "Business solution",
            "content": [
              "Learn365 is a multilingual chatbot100% integrated with Microsoft Teams. It supports employees to improve theirOffice 365 skills by answering all their questions 24/7.\n\u003Cbr\u003E\n\u003Cbr\u003EUpon installing Learn365 in your Microsoft Teams, employeeswill:\n\u003Cbr\u003E \n\u003Cbr\u003EDiscover Office 365 tools: OneDrive, \u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;OneNote, Yammer, Teams, and Outlook.\n\u003Cbr\u003E \n\u003Cbr\u003EUnderstand which tools to use and how to use them. It contains four learning paths and HD videos.\n\u003Cbr\u003E \n\u003Cbr\u003EFind best practices, tips, and tricks based on their roles.\n\u003Cbr\u003E\n\u003Cbr\u003ELearn can answer questions in fourlanguages: English, French, Spanish and Italian. When possible, it will show the HQ video related to the question tohelp visualize the solution.\n\u003Cbr\u003E\n\u003Cbr\u003EWhen the chatbotdoesn\u0027t have the correct answer, it will escalate it to human support.Every question escalated is an opportunity to improve Learn365 knowledge base andcapabilities.\n\u003Cbr\u003E\n\u003Cbr\u003EMoreover, Learn365 can send push notificationsto users making its adoption easier. Receiving notifications guaranteesthat employees remember the chatbot is always ready to help. \n\u003Cbr\u003E\n\u003Cbr\u003ELearn365 is a suitable application for anyemployee, regardless of their experience level."
            ]
          },
          {
            "name": "Success factors",
            "content": [
              "Howto make the most of Learn365? Three simple actions can increase the success ofLearn in your organization:\n\u003Cbr\u003E\n\u003Cbr\u003E * \u0026nbsp;Install and pinLearn365 in all employees’ MicrosoftTeams menu.\n\u003Cbr\u003E * \u0026nbsp;Use pushcommunication to attract employees’ attention. Trigger a push message when the user opensMicrosoft Teams: “Hey, I’m here to help!”. Or to communicate the latestupdates.\n\u003Cbr\u003E * \u0026nbsp;Team up withInternal Communications to ensureall employees know that Learn is available on Microsoft Teams.\n\u003Cbr\u003E\n\u003Cbr\u003EThese actions will ensure employees know where to go when in doubt withOffice 365."
            ]
          }
        ],
        "mediaAssets": [
          {
            "type": "image",
            "order": 0,
            "url": "assets/Learn365-image2.png",
            "alt": ""
          },
          {
            "type": "image",
            "order": 1,
            "url": "assets/Learn365-image1.png",
            "alt": ""
          },
          {
            "type": "image",
            "order": 2,
            "url": "assets/Learn365-image5.png",
            "alt": ""
          },
          {
            "type": "image",
            "order": 3,
            "url": "assets/Learn365-image4.png",
            "alt": ""
          },
          {
            "type": "image",
            "order": 4,
            "url": "assets/Learn365-image3.png",
            "alt": ""
          }
        ],
        "detailItemCategories": [
          {
            "name": "Resources",
            "description": "Possible html supported text shown just above the list of links",
            "items": [
              {
                "url": "https://appsource.microsoft.com/en-us/product/office/WA200001308",
                "name": "Download the free version of Learn365 from Appsource"
              },
              {
                "url": "https://www.witivio.com/en/office-365-adoption/",
                "name": "Contact us"
              }
            ]
          }
        ]
      }
    }
  }
}