{
  "partnerId": "workplace-buddy",
  "categories": [],
  "industries": [],
  "solutions": null,
  "sortOrder": 0,
  "preview": false,
  "visible": true,
  "logoPicture": null,
  "logoPictureAlt": "",
  "heroPicture": "assets/hero.png",
  "featuredPicture": "assets/featured.png",
  "partnerName": "WorkplaceBuddy",
  "mpnId": null,
  "metadata": {
    "displayInfo": {
      "default": {
        "shortDescription": "Hey, let us be your tour guide to digital success! WorkplaceBuddy helps employees personally to become digitally skilled with a proactive chatbot and e-learning... with lots of fun!",
        "featuredTitle": "Working with digital tools should not feel like a struggle, alpacas come to your rescue!",
        "featuredParagraphs": [
          "Understanding the needs of each person is very important for us, we help employees to make the change they are looking for: from someone who has never seen Microsoft 365 to advanced users. That\u0027s why we start with an interview, to get to know you better. This gives us the insights to automatically create a relevant, personal learning journey. The interview also returns general company insights, so you can find out the exact digital skill gap in your company and take appropriate action.",
          "WorkplaceBuddy creates relevant Microsoft 365 content (besides that we are a Microsoft Learning Pathways Partner). As we continuously monitor (anonymously) conversations and e-learnings and thereby the trends in interests of users, we build relevant content. Our content motivates, inspires and is fun. We deliver this content in campaigns, where the chatbot will proactively reach out to persons who need this content.",
          "What happens to all colleagues who feel they can\u0027t keep up with your digital developments? If you want to make impact with your organization, you have to enable your colleagues to become digital winners. Of course, each organization is different and that\u0027s why we\u0027ve build an administrator side where you can monitor, add your own specific content (be it chatbot conversations or e-learnings) and create your own badges (motivating colleagues to go for your organization\u0027s goals)."
        ],
        "callToAction": {
          "title": "We\u0027d love to hear from you!",
          "description": "For organizations that want to get the most out of their digital tools and want to take care of their colleagues, we are here to help! In a call we can demo our product and discuss your challenges.",
          "url": "https://outlook.office365.com/owa/calendar/WorkplaceBuddyDemoviaMicrosoft@workplacebuddy.com/bookings/"
        },
        "mediaAssets": [
          {
            "type": "image",
            "order": 0,
            "url": "assets/Hero.png",
            "alt": ""
          },
          {
            "type": "image",
            "order": 1,
            "url": "assets/Featured.png",
            "alt": ""
          }
        ],
        "detailItemCategories": [],
        "contact": "Thomas Meijerink"
      }
    }
  }
}