{
  "partnerId": "solutions2share",
  "categories": [],
  "industries": [],
  "solutions": null,
  "sortOrder": 0,
  "preview": false,
  "visible": true,
  "logoPicture": null,
  "logoPictureAlt": "",
  "heroPicture": "assets/hero.png",
  "featuredPicture": "https://www.youtube.com/embed/EmvGa7JDJr4",
  "partnerName": "Solutions2Share",
  "mpnId": null,
  "metadata": {
    "displayInfo": {
      "default": {
        "shortDescription": "Our solutions for Microsoft Teams, SharePointand Office 365 make your daily work easier. Our products add collaboration andgovernance features to help you keep control of your environment.",
        "featuredTitle": "Governance for Microsoft Teams and Office 365 with Apps from Solutions2Share",
        "featuredParagraphs": [
          "Solutions2Share developssoftware solutions for Microsoft Teams and SharePoint Office 365. Our productshas been installed more than 40,000 times by customers in 72 countries. We area Microsoft Gold Partner with certified knowledge and expertise in solutionsfor collaboration and governance. Our products focus on improving your workwith Microsoft 365 by adding governance and collaboration features forMicrosoft SharePoint and Microsoft Teams.\n\u003Cbr\u003E\n\u003Cbr\u003E * \u0026nbsp;Teams Manager is an easy-to-use app for templates,governance and lifecycle management in Microsoft Teams. Features also includean automated request \u0026amp; approval workflow, naming conventions, metadata andmore.\n\u003Cbr\u003E * \u0026nbsp;External User Manager enables you to manage guestaccess in Microsoft Teams. Users can request access for guest users, whileadmins get an overview of permissions and external user access history as wellas extensive reports.\n\u003Cbr\u003E * \u0026nbsp;For template management and provisioning in SharePointand Office 365, take a look at our Collaboration Manager – it also providesextensive authorization and governance features. \n\u003Cbr\u003E * \u0026nbsp;Additional apps include MindMap, for creatingmind maps in MS Teams, and Hyperlinks, to save and share links to websites,teamsites, files or conversations as bookmarks in Teams."
        ],
        "callToAction": {
          "title": "Keep Control Of Your Microsoft Teams, SharePoint and Office 365!",
          "description": "Our solutions for governance and collaboration make your daily work easier. We offer free demos for all our products – schedule a demo with your personal Microsoft 365 specialist today!",
          "url": "https://www.solutions2share.com"
        },
        "mediaAssets": [
          {
            "type": "image",
            "order": 0,
            "url": "assets/Hero.png",
            "alt": ""
          },
          {
            "type": "video",
            "order": 1,
            "url": "https://www.youtube.com/embed/EmvGa7JDJr4",
            "alt": ""
          }
        ],
        "detailItemCategories": [],
        "contact": null
      }
    }
  }
}