{
  "solutionId": "clobba-vr",
  "partnerId": "code-software",
  "categories": [
    "teams"
  ],
  "industries": [],
  "sortOrder": 0,
  "preview": false,
  "visible": false,
  "solutionLogoPicture": null,
  "solutionLogoPictureAlt": "",
  "solutionName": "Clobba VR",
  "solutionUrl": "https://www.codesoftware.net/clobba-vr/",
  "solutionUrlTitle": "Clobba VR",
  "metadata": {
    "personas": "Leadership;Sales Managers",
    "businessFunctions": null,
    "displayPartner": false,
    "appSource": null,
    "displayInfo": {
      "default": {
        "descriptionParagraphs": [
          {
            "name": "Short description",
            "content": [
              "Asimple to use and affordable Voice Recording solution specifically built for MSTeams"
            ]
          },
          {
            "name": "Long description",
            "content": []
          },
          {
            "name": "Business need or problem",
            "content": [
              "Many organizations usingTeams have basic voice recording requirements where they need to easily locatea call and play it back. The recorded call can then be used for training andmonitoring purposes or to confirm the details of the call. Team leaders mayneed to access and listen to team members’ calls and Clobba VR allows for thisvia a simple user interface."
            ]
          },
          {
            "name": "Business solution",
            "content": [
              "Installed on a customer’s Teams tenant servers means fullrights of ownership are retained with the recorded calls remaining in acustomer’s environment. Recorded users must have a MS Teams Phone Systemlicence allowing for recording of inbound, outbound, internal, federated andconference calls.\n\u003Cbr\u003E\n\u003Cbr\u003EThe recordedcalls can be played back or downloaded for review and sharing. Live calls canbe listened to by employees with the correct user policies through the ‘silentmonitoring’ feature. There is even the ability to manually pause and resume therecording for compliancy situations.\n\u003Cbr\u003E\n\u003Cbr\u003EAndas Clobba VR is installed in a customer environment they have full ownership ofthe recorded calls and can retain the calls for whatever duration is required."
            ]
          },
          {
            "name": "Success factors",
            "content": [
              "Ourcustomers have seen an increase in agent performance through the ability totailor employee training. Customer disputes are quickly resolved with therecordings verifying any customer discrepancies."
            ]
          }
        ],
        "mediaAssets": [
          {
            "type": "image",
            "order": 0,
            "url": "assets/ClobbaVR-image2.png",
            "alt": ""
          },
          {
            "type": "image",
            "order": 1,
            "url": "assets/ClobbaVR-image1.png",
            "alt": ""
          }
        ],
        "detailItemCategories": [
          {
            "name": "Resources",
            "description": "Possible html supported text shown just above the list of links",
            "items": [
              {
                "url": "http://www.codesoftware.net/",
                "name": "Clobba VR is available on a free 30-day trial and is installed in customer environments."
              }
            ]
          }
        ]
      }
    }
  }
}