{
  "partnerId": "storyals",
  "categories": [],
  "industries": [],
  "solutions": null,
  "sortOrder": 0,
  "preview": false,
  "visible": true,
  "logoPicture": null,
  "logoPictureAlt": "",
  "heroPicture": "assets/hero.png",
  "featuredPicture": null,
  "partnerName": "Storyals",
  "mpnId": "0",
  "metadata": {
    "displayInfo": {
      "default": {
        "shortDescription": "Storyals provides story-based learningsolutions and high-quality adoption services to build digital skills for themodern workplace. With Storyals solutions you can inspire, motivate and educateyour users to achieve more - one story at a time.",
        "featuredTitle": "Build digital skills and work smarter with Storyals!",
        "featuredParagraphs": [
          "Accelerate digital workplace adoption and build digital skills with Storyals. We provide unique story-based learning solutions to continuously encourage new ways of working to achieve more. Learn from experts and improve the way you work with digital tools in Microsoft 365.",
          "Storyals learning solutions provide users with a blended program, combining self-paced and instructor-led training, leveraging storytelling to maximize learning. All learning topics highlight digital workplace best practices and feature real-world scenarios. Not everyone welcomes change. With Storyals, users are made aware of the benefits of modern tools and get inspired and motivated to try new ways of working.",
          "Add an “Adoption Workshop” and let our experts help you form an adoption plan, join our “Digital Community Gym” to kick-start the new routine and build champions by putting them through a “Digital Champions Bootcamp” where they get 1-1 coaching. \n\u003Cbr\u003E \u0026nbsp;\n\u003Cbr\u003EWe love helping our customers simply work smarter!"
        ],
        "callToAction": {
          "title": "Book a free demo!",
          "description": "Book a free demo to see us in action. Learn more about how Storyals can help your organization achieve more.",
          "url": "https://www.storyals.com"
        },
        "mediaAssets": [
          {
            "type": "image",
            "order": 0,
            "url": "assets/Hero.png",
            "alt": ""
          }
        ],
        "detailItemCategories": [],
        "contact": "Ulrika Hedlund"
      }
    }
  }
}