{
  "solutionId": "evolve-365",
  "partnerId": "planet-technologies",
  "categories": [
    "learningpathways"
  ],
  "industries": [
    "Commercial",
    "Education",
    "Federal",
    "Government"
  ],
  "servicesUsed": [
    "Azure",
    "Azure Bot",
    "Graph API",
    "SPFx"
  ],
  "sortOrder": 0,
  "preview": false,
  "visible": true,
  "solutionLogoPicture": null,
  "solutionLogoPictureAlt": "",
  "solutionName": "Evolve 365 – Microsoft 365 Adoption Solutions",
  "solutionUrl": "https://o365support.com/solutions/evolve-365/",
  "solutionUrlTitle": "Evolve 365 – Microsoft 365 Adoption Solutions",
  "metadata": {
    "personas": "Business Users;Information Workers",
    "businessFunctions": null,
    "businessValue": "\u003Cdiv\u003EChange can be very frustrating to end users. They often get confused and feel as if they have no resources to help them with the constant changes, they are seeing in Office 365.The trainers within these organizations want to help them, but with limited resources at their disposal, they are struggling to manage the changes as well. They simply have no one to go to for additional help and training. The result is that your users don’t embrace and use the new technologies and revert to the old way of doing things. This means productivity is lost and user frustration grows. \u0026nbsp;\n\u003Cbr\u003E \u003C/div\u003E\u003Cbr\u003E\u003Cdiv\u003EMany of the new features that are rolling out will be considered minimal impact to your users as they are considered incremental features. But, what Microsoft considers to be minimal impact to a user’s daily work and what the actual impact can be, may vary greatly. \u0026nbsp;These impacts are often seen with the addition of new features, such as new options on the toolbars or menus. These typically result in a new and easier way to complete the same task a user might have already been working on. In many cases, Microsoft might try to provide education and on-screen guidance for the new features, but often new buttons and new options just show up and users will need to navigate through them to complete common tasks or figure out how to navigate around them. If your users aren’t prepared for these types of constant incremental changes –instead of seeing them as small things to delight them and make their daily tasks easier, they will instead see them as blockers to productivity and will once again become increasingly frustrated with the tools and technology provided to them. At this point they will either start to push against change or they will start to find ways to implement their own shadow IT solutions, completely going around you in the process.\n\u003Cbr\u003E \u003C/div\u003E\u003Cbr\u003E\u003Cdiv\u003EThe truth is, managing the new way of doing things is tricky and unless you are doing it all day every day – it can be overwhelming. This is where Planet Technologies can help you and be a lifeline to keep you connected to Microsoft. We can be there for you to help you make sense of the noise and focus in on the pieces of information that will have the most impact to you and your agency. Planet Technologies can also help you understand the needs of your users and help them map those needs to specific technologies and approaches within Microsoft 365 to help them reduce frustrations with current tasks, while increasing user productivity and user satisfaction. \u003C/div\u003E",
    "displayPartner": false,
    "appSource": null,
    "displayInfo": {
      "default": {
        "descriptionParagraphs": [
          {
            "name": "Short description",
            "content": [
              "\u003Cdiv\u003EEvolve365 is a Planet Technologies methodology and service that drives learning and promotes user adoption. Custom learning solutions that fit your needs and your work force. \u003C/div\u003E"
            ]
          },
          {
            "name": "Long description",
            "content": [
              "\u003Cdiv\u003E\u003Cspan style=\u0022display:inline !important;\u0022\u003EEvolve 365 includes a dedicated Microsoft Learning Strategist familiar with user adoption, the changes of Office 365, and driving users to embrace new technology. They work with your team to create and maintain relationships with end-users. Here are just a few ways Evolve 365 works for you and your team: Thousands of Training \u0026amp; Micro-Training Videos, Training \u0026amp; Communication Plans, Custom Playlists, Monthly Office Hours, Communication Campaigns, and Ongoing Usage and Adoption Analysis.\u003C/span\u003E\u003Cbr\u003E \u003C/div\u003E"
            ]
          },
          {
            "name": "Business need or problem",
            "content": [
              "\u003Cdiv\u003EWhen you look at the overall deployment of any new technology or new way of doing things, it doesn’t take long to see that simply deploying the solution is never all there is to the story. Deployment is not adoption, and, in most cases, the actual implementation of the technology is the easiest part of the entire project. If our IT projects were based solely on the deployment of the technology and could ignore the social, economic, and cultural issues – implementing new solutions would be the easiest task we ever took on! \u003C/div\u003E"
            ]
          },
          {
            "name": "Business solution",
            "content": [
              "\u003Cdiv\u003EWithall these things in mind, Planet Technologies has crafted a complete learning solution – designed purposefully to bring together all aspects of learning and change management to your Microsoft 365 deployments. \u0026nbsp;No matter if you are just getting ready to migrate to Office 365 or if you have been there for years. \u0026nbsp;Evolve 365 is a flexible solution designed to meet your users where they are, help them understand the technology available to them and help them understand how it can help them transform how they work together.\n\u003Cbr\u003E \u003C/div\u003E\u003Cbr\u003EEvolve365 Includes:\n\u003Cbr\u003E\u003Cbr\u003E * \u0026nbsp;Dedicated Learning Strategist\n\u003Cbr\u003E * \u0026nbsp;Custom Training Playlist\n\u003Cbr\u003E\u003Cdiv\u003E * \u0026nbsp;Online Videos \u0026amp; Training Playlist – Updated with Office 365 Feature Release Cycles \n\u003Cbr\u003E \u003C/div\u003E\u003Cdiv\u003E * \u0026nbsp;Custom Training – including Cyber Security and CMMC Training\n\u003Cbr\u003E \u003C/div\u003E\u003Cdiv\u003E * \u0026nbsp;Content Curated for GCC, GCC-H and DoD Cloud Environments \u003C/div\u003E"
            ]
          },
          {
            "name": "Success factors",
            "content": [
              "\u003Cdiv\u003EOne of the key components of Evolve 365 is that every subscription includes a dedicated Microsoft certified service adoption specialist who will partner with you to help you map out a customized learning and adoption strategy that aligns with the specific needs of your users and culture. This Evolve 365 Learning Strategist will work with you to understand the styles that your users learn the best, what has worked previously and will suggest new and creative ways to provide additional learning opportunities moving forward. They will be responsible for onboarding your Evolve 365 experience and will be checking in with you regularly throughout your subscription to ensure that users are effectively accessing Evolve 365 and that it is driving additional usage with Office 365. They start the process by asking questions about your users and your agency and then throughout the entire subscription they monitor the success of your adoption efforts, ensuring that your ROI is growing throughout your entire subscription. Learning \u0026amp; Adoption Strategists are also responsible for working with your team to ensure that training is effective and is driving an increase in the use of Microsoft 365 across your userbase. Through the Office 365 Usage Reports and integrated adoption reports within Evolve 365, your dedicated Adoption Strategist is able to help you see how training is directly impacting your Office 365 usage, identify areas where additional training could be helpful, and identify any common trends in Office 365 usage patterns. By continually monitoring all of this information and using it to update your customized learning plan, you can be assured that your training and adoption strategy will always be relevant to the current needs, pain points and technologies that your users are experiencing. \u0026nbsp;Without this level of monitoring, you are only able to go on gut instinct and generic training and communication plans designed for the masses and meant to drive the training Microsoft deems relevant. \u003C/div\u003E"
            ]
          }
        ],
        "mediaAssets": [
          {
            "type": "image",
            "order": 0,
            "url": "assets/Evolve365-Image2.jpg",
            "alt": ""
          },
          {
            "type": "image",
            "order": 1,
            "url": "assets/Evolve365-Image1.jpg",
            "alt": ""
          },
          {
            "type": "image",
            "order": 2,
            "url": "assets/Evolve365-Image4.jpg",
            "alt": ""
          },
          {
            "type": "image",
            "order": 3,
            "url": "assets/Evolve365-Image3.jpg",
            "alt": ""
          },
          {
            "type": "image",
            "order": 4,
            "url": "assets/Evolve365-Image5.jpg",
            "alt": ""
          },
          {
            "type": "video",
            "order": 5,
            "url": "https://www.youtube.com/embed/3RIN_w_RPE0",
            "alt": ""
          }
        ],
        "detailItemCategories": [
          {
            "name": "Resources",
            "description": "Possible html supported text shown just above the list of links",
            "items": [
              {
                "url": "https://o365support.com/solutions/evolve-365/",
                "name": "Evolve 365 Overview"
              },
              {
                "url": "https://o365support.com/solutions/champions-program/",
                "name": "Evolve 365 Champions Program"
              },
              {
                "url": "https://o365support.com/solutions/featured-plans/",
                "name": "Evolve 365 Plans"
              },
              {
                "url": "https://o365support.com/success-stories/",
                "name": "Evolve 365 Case Studies"
              }
            ]
          }
        ]
      }
    }
  }
}