{
  "solutionId": "teamshub",
  "partnerId": "cyclotron",
  "categories": [
    "teams"
  ],
  "industries": [],
  "servicesUsed": [
    "Custom Tabs",
    "Graph API",
    "Messaging Extension",
    "Power App",
    "Power Automate",
    "SPFx"
  ],
  "sortOrder": 0,
  "preview": false,
  "visible": false,
  "solutionLogoPicture": null,
  "solutionLogoPictureAlt": "",
  "solutionName": "TeamsHUB by Cyclotron",
  "solutionUrl": "https://cyclotrongroup.com/company/contact-us/",
  "solutionUrlTitle": "TeamsHUB by Cyclotron",
  "metadata": {
    "personas": "End-user;IT Admin",
    "businessFunctions": "Adoption;Engagement;Governance",
    "businessValue": "TeamsHUB has provided a streamlined experience to both IT and users within organizations around the globe, including:\n\u003Cbr\u003E\n\u003Cbr\u003E * \u0026nbsp;Increased engagement from users in Microsoft Teams.\n\u003Cbr\u003E * \u0026nbsp;Higher quality insights into operations and governance within the organization.\n\u003Cbr\u003E * \u0026nbsp;Greater visibility into Microsoft 365 as a whole and the progress towards digital transformation.",
    "displayPartner": true,
    "appSource": null,
    "displayInfo": {
      "default": {
        "descriptionParagraphs": [
          {
            "name": "Short description",
            "content": [
              "TeamsHUB is a governance, adoption, and employee engagement platform built on Microsoft Teams."
            ]
          },
          {
            "name": "Long description",
            "content": []
          },
          {
            "name": "Business need or problem",
            "content": [
              "In a world where customers need to be agile and innovative, they are struggling to provide rich contextual experiences to their users. Customers are looking for innovative solutions, which feature seamless integrations into Microsoft Teams, such as:\n\u003Cbr\u003E\n\u003Cbr\u003E * \u0026nbsp;An automated, simple interface to apply governance for Microsoft Teams creation, approval, lifecycle management, and enforcement of security/standards.\n\u003Cbr\u003E * \u0026nbsp;Enforcement of data protection and governance policies based on digital assets.\n\u003Cbr\u003E * \u0026nbsp;Tracking and monitoring of teams, automated archival and deletion policies, compliance reporting and actions (i.e. year end auditing), and an owner notification system.\n\u003Cbr\u003E * \u0026nbsp;Mobile-first approach to consume org-wide news, access resources like benefits, HR, travel reimbursements, etc., within Microsoft Teams.\n\u003Cbr\u003E * \u0026nbsp;Integrated learning and training systems for users to become \u0026quot;power users\u0026quot; and leverage more functionality in the Microsoft 365 ecosystem.\n\u003Cbr\u003E\n\u003Cbr\u003ETeamsHUB features a set of experiences that provide an organization the ability to quickly and easily configure their users’ Microsoft Teams client to access this information and drive high business value and rich user experiences – increasing adoption and ROI."
            ]
          },
          {
            "name": "Business solution",
            "content": [
              "Cyclotron has developed a solution capable of helping organizations define and execute the rules for Microsoft Teams governance, increase employee engagement, improve productivity, and drive adoption of Microsoft 365 – increasing human efficiency:\n\u003Cbr\u003E\n\u003Cbr\u003E * \u0026nbsp;Automate team requests and creation using templates, approval workflows and dynamic forms using custom metadata columns.\n\u003Cbr\u003E * \u0026nbsp;Manage how Teams are named using a managed blocked words list and custom policies.\n\u003Cbr\u003E * \u0026nbsp;Control the expiry, retention, and disposal of teams based on usage and activity.\n\u003Cbr\u003E * \u0026nbsp;Provide users with personalized content and pages – ensuring they feel connected and are productive.\n\u003Cbr\u003E * \u0026nbsp;Quickly set up a self-service learning portal – enabling users to enjoy learning and feel informed.\n\u003Cbr\u003E * \u0026nbsp;Capture feedback, gauge sentiment, and understand where users are struggling or need more clarity to be successful."
            ]
          },
          {
            "name": "Success factors",
            "content": [
              "Organizations around the globe in various industries can benefit from TeamsHUB, which provide critical automation of key tasks, enhanced reporting capabilities, and increased user engagement through rich, contextual experiences:\n\u003Cbr\u003E\n\u003Cbr\u003E * \u0026nbsp;Automate and manage provisioning, operations and information lifecycle integrated with Microsoft Teams.\n\u003Cbr\u003E * \u0026nbsp;Ensure internal, external and regulatory compliance.\n\u003Cbr\u003E * \u0026nbsp;Ease adoption, usage and governance.\n\u003Cbr\u003E * \u0026nbsp;Increase administrator efficiency.\n\u003Cbr\u003E * \u0026nbsp;Implement reliable governance tools to enable consistent processes and controls, and mitigate risks for Microsoft Teams.\n\u003Cbr\u003E\n\u003Cbr\u003ETeamsHUB can transform your organization with the insights provided and effective tools for employee engagement."
            ]
          }
        ],
        "mediaAssets": [
          {
            "type": "image",
            "order": 0,
            "url": "assets/TeamsHUB_Dashboard.PNG",
            "alt": ""
          },
          {
            "type": "image",
            "order": 1,
            "url": "assets/TeamsHUB_Analytics.png",
            "alt": ""
          }
        ],
        "detailItemCategories": [
          {
            "name": "Resources",
            "description": "Possible html supported text shown just above the list of links",
            "items": []
          }
        ]
      }
    }
  }
}