{
  "solutionId": "valoteamwork",
  "partnerId": "valo",
  "categories": [
    "teams"
  ],
  "industries": [],
  "servicesUsed": [
    "Azure",
    "Graph API",
    "Microsoft Teams",
    "SharePoint sites",
    "SPFx"
  ],
  "sortOrder": 0,
  "preview": false,
  "visible": false,
  "solutionLogoPicture": null,
  "solutionLogoPictureAlt": "",
  "solutionName": "Valo Teamwork",
  "solutionUrl": "https://www.valointranet.com/valo-teamwork",
  "solutionUrlTitle": "Valo Teamwork",
  "metadata": {
    "personas": "HR;IT Admin;Project Manager",
    "businessFunctions": "Governance;Human Resources;IT;Project Management Offices;Project Managers",
    "businessValue": "Valo Teamwork enables power users and administrators to automate the creation of workspaces and avoid pitfalls. Additional governance features enable administrators to identify Microsoft Teams and Microsoft 365 groups without owners, members, and enterprise metadata. Moreover, an advanced analytics area enables administrators to analyze the usage of the workspaces by providing information such as external sharing, different privacy levels and archiving status.\n\u003Cbr\u003E\n\u003Cbr\u003EBasically, Valo Teamwork reduces costs by offering a standardized creation process, which is based on pre-defined templates allowing end users to create ready-to-go digital workspaces. Moreover, Valo Teamwork reduces IT costs by helping IT Administrators reduce repetitive manual work. Additionally, end users take advantage of an integrated dashboard that offers a single view for all end users’ digital teams, projects, groups, and sites.",
    "displayPartner": false,
    "appSource": null,
    "displayInfo": {
      "default": {
        "descriptionParagraphs": [
          {
            "name": "Short description",
            "content": [
              "Valo Teamwork is your automated one-stop-shop for digital collaboration in Microsoft 365."
            ]
          },
          {
            "name": "Long description",
            "content": []
          },
          {
            "name": "Business need or problem",
            "content": [
              "Governing the creation of Microsoft Teams teams, Microsoft 365 groups, Yammer Groups, and SharePoint sites is already possible in Microsoft 365. However, in many scenarios, it requires unnecessary, repetitive manual work from IT Administrators hindering the flow of collaboration from the project team which can slow down productivity. Moreover, there is no place in Microsoft 365 OOTB to find all workspaces and search groups and sites based on enterprise metadata, different template types, and display name. Valo Teamwork is the solution with automated governance including naming policies, default membership, security features, and much more."
            ]
          },
          {
            "name": "Business solution",
            "content": [
              "Valo Teamwork is a digital collaboration solution that can be used to automate the creation of Microsoft Teams teams, Microsoft 365 groups, Yammer Groups, and SharePoint sites (classic and modern). The creation process supports customizable templates that power users and administrators can create based on their business needs. All templates support governance, lifecycle management, and provisioning features. Here is a list of some important functionalities that can be configured at a template level:\n\u003Cbr\u003E\n\u003Cbr\u003EGovernance\n\u003Cbr\u003E\n\u003Cbr\u003E * \u0026nbsp;Naming policies (different rules for URL and display name with support for suffix, prefix, and banned words).\n\u003Cbr\u003E * \u0026nbsp;Membership settings (default owners/members and minimum number of owners/members).\n\u003Cbr\u003E * \u0026nbsp;Privacy settings (sensitivity labels, external sharing, and public/private).\n\u003Cbr\u003E * \u0026nbsp;Terms and conditions (users will need to accept the terms and conditions before creating a team).\n\u003Cbr\u003E * \u0026nbsp;Limit access to templates to specific users.\n\u003Cbr\u003E\n\u003Cbr\u003EProvisioning\n\u003Cbr\u003E\n\u003Cbr\u003E * \u0026nbsp;PnP support.\n\u003Cbr\u003E * \u0026nbsp;Site Designs support.\n\u003Cbr\u003E * \u0026nbsp;Enterprise metadata.\n\u003Cbr\u003E * \u0026nbsp;Planner templates (buckets and tasks).\n\u003Cbr\u003E * \u0026nbsp;Teams (icon, settings, apps, channels, tabs [pre-configured tabs] and chat messages).\n\u003Cbr\u003E\n\u003Cbr\u003ELifecycle\n\u003Cbr\u003E\n\u003Cbr\u003E * \u0026nbsp;Enable/disable approval for all templates\n\u003Cbr\u003E * \u0026nbsp;Power Automate support (build complex workflows for approval)\n\u003Cbr\u003E * \u0026nbsp;Guided steps to create a team based on a template\n\u003Cbr\u003E * \u0026nbsp;Manual archiving after workspace creation\n\u003Cbr\u003E * \u0026nbsp;Auto-archiving (coming soon)\n\u003Cbr\u003E\n\u003Cbr\u003EEnd users can create workspaces based on pre-defined templates. This is possible through an innovative, self-explanatory, and modern request form. After creation, users can search for their workspaces using an integrated dashboard which supports searching for display name as well as filtering by enterprise metadata and template type. Everything is accessible from Microsoft Teams via a personal app and from SharePoint using a SPFx web part."
            ]
          },
          {
            "name": "Success factors",
            "content": [
              "Valo Teamwork simplifies the governance of Microsoft Teams and other types of workspaces in Microsoft 365. Please find below a list of benefits:\n\u003Cbr\u003E\n\u003Cbr\u003E * \u0026nbsp;Comprehensive Microsoft Teams templates allow end users to create ready-to-use Microsoft Teams teams. This allows end-users to focus on other tasks rather than configuring workspaces.\n\u003Cbr\u003E * \u0026nbsp;Enhanced governance and templating features allow administrators to avoid pitfalls and create Microsoft Teams teams and other types of workspaces with pre-defined rules.\n\u003Cbr\u003E * \u0026nbsp;A unified creation process allows end users to create any type of workspace (incl. Microsoft Teams) from one single place with pre-defined configuration and content.\n\u003Cbr\u003E * \u0026nbsp;End users can access all the workspaces they need in daily work from an integrated dashboard.\n\u003Cbr\u003E * \u0026nbsp;Valo Teamwork can be used directly from Microsoft Teams as a personal app and as a web part in SharePoint.\n\u003Cbr\u003E\n\u003Cbr\u003EOur customers have been using Valo Teamwork to automatically create, manage, and control their workspaces in Microsoft 365!"
            ]
          }
        ],
        "mediaAssets": [
          {
            "type": "image",
            "order": 0,
            "url": "assets/Valo Teamwork1 - Teams.png",
            "alt": ""
          },
          {
            "type": "image",
            "order": 1,
            "url": "assets/Valo Teamwork2-Sharepoint.png",
            "alt": ""
          },
          {
            "type": "image",
            "order": 2,
            "url": "assets/Valo Teamwork3-Edit template.png",
            "alt": ""
          },
          {
            "type": "video",
            "order": 3,
            "url": "https://www.youtube.com/embed/h91ZHGuCaX4",
            "alt": ""
          }
        ],
        "detailItemCategories": [
          {
            "name": "Resources",
            "description": "Possible html supported text shown just above the list of links",
            "items": []
          }
        ]
      }
    }
  }
}