{
  "solutionId": "orchestry",
  "partnerId": "orchestry-software",
  "categories": [
    "teams"
  ],
  "industries": [],
  "servicesUsed": [
    "Azure",
    "Custom Tabs",
    "Graph API",
    "PnP Framework",
    "SharePoint API",
    "SharePoint sites",
    "SPFx"
  ],
  "sortOrder": 0,
  "preview": false,
  "visible": true,
  "solutionLogoPicture": null,
  "solutionLogoPictureAlt": "",
  "solutionName": "Orchestry",
  "solutionUrl": "https://orchestry.com/",
  "solutionUrlTitle": "Orchestry",
  "metadata": {
    "personas": "Developer;End-user;IT Admin",
    "businessFunctions": "Adoption;Change Management;Governance",
    "businessValue": "Whether you are just starting with Microsoft Teams or have already deployed and driving usage, Orchestry will help you:\n\u003Cbr\u003E\n\u003Cbr\u003E * \u0026nbsp;Reduce cost of provisioning and customizing teams – estimated average of $6K per team/site.\n\u003Cbr\u003E * \u0026nbsp;Reduce the cost of end-user training and adoption tool – estimated average of $6K.\n\u003Cbr\u003E * \u0026nbsp;Lessen time to value with Microsoft Teams by providing out-of-the-box templates and experiences that are easy to use.",
    "displayPartner": false,
    "appSource": null,
    "displayInfo": {
      "default": {
        "descriptionParagraphs": [
          {
            "name": "Short description",
            "content": [
              "Orchestry is your governance, adoption, provisioning, and enablement tool for Microsoft Teams."
            ]
          },
          {
            "name": "Long description",
            "content": [
              "\u003Cdiv\u003E\u003Cspan style=\u0022display:inline !important;\u0022\u003EOrchestry makes work simple in Microsoft Teams, SharePoint Online and across Microsoft 365 providing transparent governance and self-service provisioning to drive usage and adoption all the way through to end users through simplifying the interface and providing a beautiful user experience.\u003C/span\u003E\u003Cbr\u003E \u003C/div\u003E"
            ]
          },
          {
            "name": "Business need or problem",
            "content": [
              "As more organizations standardize on Microsoft Teams as their primary method of communication and collaboration, challenges have begun to surface around:\n\u003Cbr\u003E\n\u003Cbr\u003E * \u0026nbsp;Setting up a new project, knowing what to use when, do I set up a Teams team, SharePoint site, Yammer Community – the list goes on.\n\u003Cbr\u003E * \u0026nbsp;Creating a team is either too tightly controlled, creating bottlenecks in productivity, OR far too enabled, which creates duplication and sprawl\n\u003Cbr\u003E * \u0026nbsp;Customizing a workspace is too time consuming and challenging for a user – what permissions need to be set, what apps are enabled, etc.\n\u003Cbr\u003E\n\u003Cbr\u003EOrchestry is a balanced platform, which simplifies the process of creating a collaboration workspace in Microsoft Teams, empowering users to ‘self-serve’ (driving usage and adoption of Microsoft 365) and enabling admins to provide valuable insights into how their user base is leveraging Microsoft 365 to transform the way their organization works."
            ]
          },
          {
            "name": "Business solution",
            "content": [
              "Orchestry is a comprehensive governance, adoption, and enablement solution used to simplify the Microsoft 365 experience through a balance of adoption tools, engaging pre-built templates, controlled provisioning, transparent governance and manicured self-service for administrators all the way through end users, natively built within Microsoft Teams. Orchestry’s core capabilities include:\n\u003Cbr\u003E\n\u003Cbr\u003ETransparent governance:\n\u003Cbr\u003E\n\u003Cbr\u003E * \u0026nbsp;Manage the creation of Microsoft Teams teams, Outlook Groups, SharePoint communication sites, and SharePoint sites.\n\u003Cbr\u003E * \u0026nbsp;Govern teams and sites through end-to-end provisioning lifecycle management.\n\u003Cbr\u003E * \u0026nbsp;Control naming policies while surfacing existing teams and sites with the informative Workspace Directory.\n\u003Cbr\u003E * \u0026nbsp;Define default owner/member settings with set minimums.\n\u003Cbr\u003E * \u0026nbsp;Streamline workspace requests with automated workflows and approvals.\n\u003Cbr\u003E\n\u003Cbr\u003ESelf-service provisioning:\n\u003Cbr\u003E\n\u003Cbr\u003E * \u0026nbsp;Intuitive, beautifully-designed and interactive Workspace request wizard.\n\u003Cbr\u003E * \u0026nbsp;Request new workspace in minutes with automated approval workflows.\n\u003Cbr\u003E * \u0026nbsp;Log Workspace request history, default owners and members.\n\u003Cbr\u003E * \u0026nbsp;Add Workspace features and document templates both standard and custom.\n\u003Cbr\u003E * \u0026nbsp;Enforce naming conventions and unveil existing Workspace with like names.\n\u003Cbr\u003E * \u0026nbsp;Define and control metadata inputs as required.\n\u003Cbr\u003E\n\u003Cbr\u003EPre-built Workspace Templates:\n\u003Cbr\u003E\n\u003Cbr\u003E * \u0026nbsp;Pre-built Workspace Templates in Orchestry to save you time and money.\n\u003Cbr\u003E * \u0026nbsp;Create custom Workspace Templates with PnP templates, Site Design, and more.\n\u003Cbr\u003E * \u0026nbsp;Pre-configure Microsoft Teams tabs, channels, settings, team information, etc.\n\u003Cbr\u003E * \u0026nbsp;Add standard Features and Document Templates to templates.\n\u003Cbr\u003E * \u0026nbsp;Built-in Planner templates, SharePoint libraries, Yammer conversations, etc.\n\u003Cbr\u003E\n\u003Cbr\u003EInformative Workspace Directory:\n\u003Cbr\u003E\n\u003Cbr\u003E * \u0026nbsp;Mitigate teams and site sprawl with the informative Directory for all Workspaces.\n\u003Cbr\u003E * \u0026nbsp;Filter and sort by Workspace type, teams, sites or groups.\n\u003Cbr\u003E * \u0026nbsp;Favorite frequently used workspaces for instant access to teams/sites.\n\u003Cbr\u003E * \u0026nbsp;Look up any existing Workspace before new Workspace Request\n\u003Cbr\u003E * \u0026nbsp;Add custom metadata for further filtering and finding.\n\u003Cbr\u003E\n\u003Cbr\u003EOrchestry enables end users to request Workspaces with pre-built and/or pre-defined Workspace Templates, which includes Orchestry’s popular pre-built Workspace Templates loaded with full-developed custom web parts. Once approved, Workspaces are provisioned in just minutes with transparent governance through to the end-user. Orchestry’s intuitively-designed but extremely powerful interface makes the complex simple and the impossible plausible in Microsoft 365."
            ]
          },
          {
            "name": "Success factors",
            "content": [
              "From administrators to end users, enterprise customers agree that simplifying the provisioning and governance experience through Microsoft Teams drives standardization, user experience and ultimately, adoption. By adopting Orchestry, customers are now able to:\n\u003Cbr\u003E\n\u003Cbr\u003E * \u0026nbsp;Create a consistent experience across teams, sites and workspaces.\n\u003Cbr\u003E * \u0026nbsp;Drive a consistent governance, provisioning and enablement experience across Microsoft 365 workspaces (Microsoft Teams, SharePoint Site, etc.).\n\u003Cbr\u003E * \u0026nbsp;Manage all workspace requests and provisioning for Microsoft 365 workspaces (teams, sites, etc.) through a single unified interface both for administrators and end users.\n\u003Cbr\u003E * \u0026nbsp;Govern consistent workspace templates, naming policies, metadata, and more across both Microsoft Teams and SharePoint Online.\n\u003Cbr\u003E\n\u003Cbr\u003ECustomers have deployed Orchestry for core scenarios like project management, change management (IT), department collaboration workspaces (HR, communications, marketing), and more. Customer feedback has been consistent: Orchestry has become one of the must-have applications for deploying and managing Microsoft Teams."
            ]
          }
        ],
        "mediaAssets": [
          {
            "type": "image",
            "order": 0,
            "url": "assets/orchestry solution - 2.png",
            "alt": ""
          },
          {
            "type": "image",
            "order": 1,
            "url": "assets/orchestry solution - 1.png",
            "alt": ""
          },
          {
            "type": "image",
            "order": 2,
            "url": "assets/orchestry solution - 3.png",
            "alt": ""
          }
        ],
        "detailItemCategories": [
          {
            "name": "Resources",
            "description": "Possible html supported text shown just above the list of links",
            "items": [
              {
                "url": "https://www.orchestry.com/?utm_source=microsoft_adoption_catalog",
                "name": "Orchestry application - work made simple in Microsoft Teams"
              },
              {
                "url": "https://vimeo.com/510930153",
                "name": "Orchestry video - product overview"
              },
              {
                "url": "https://www.orchestry.com/resource/maine-source-homes-streamlines-project-management-microsoft-365",
                "name": "Orchestry customer story - Maine Source Homes project management Microsoft 365"
              },
              {
                "url": "https://www.orchestry.com/event/orchestry-live-demo-work-made-simple-in-microsoft-365-ms-teams-and-sharepoint-sites/",
                "name": "Orchestry demo - product walk-through demonstration"
              },
              {
                "url": "https://www.orchestry.com/insight/innovation/the-future-of-work/get-more-from-microsoft-365-with-orchestry/",
                "name": "Orchestry article - what Microsoft 365 challenges does Orchestry solve?"
              }
            ]
          }
        ]
      }
    }
  }
}