{
  "solutionId": "docs-custom",
  "partnerId": "sympraxis-consulting",
  "categories": [
    "learningpathways"
  ],
  "industries": [],
  "sortOrder": 0,
  "preview": false,
  "visible": false,
  "solutionLogoPicture": null,
  "solutionLogoPictureAlt": "",
  "solutionName": "Documentation for Custom Solutions",
  "solutionUrl": "https://www.sympraxisconsulting.com",
  "solutionUrlTitle": "Documentation for Custom Solutions",
  "metadata": {
    "personas": "Business Analysts;Content Owners;Developer;End-user;IT Admin;Leadership;Training \u0026 Development",
    "businessFunctions": null,
    "displayPartner": false,
    "appSource": null,
    "displayInfo": {
      "default": {
        "descriptionParagraphs": [
          {
            "name": "Short description",
            "content": [
              "Microsoft 365 offers many opportunities for customizations to your environment. These custom solutions may have specific steps to follow and likely need training documentation to support their usage. \u0026nbsp;Documenting and adding this training content to Learning Pathways for all user types helps ensure the solutions’ viability long-term, reduces technical debt, reduces support and maintenance costs, and supports end users’ ability to use the solution effectively."
            ]
          },
          {
            "name": "Long description",
            "content": []
          },
          {
            "name": "Business need or problem",
            "content": [
              "Your company has acustom solution, for example a project management tracking app, that users invarious roles interact with to complete different tasks. You need to provideunique guidance for each of these roles at the point of interaction. There isno documentation on your intranet to support this solution, so it requiresinstitutional knowledge to use it effectively. End users need the ability tolearn without leaving the context of the solution."
            ]
          },
          {
            "name": "Business solution",
            "content": [
              "Byidentifying the different personas and creating customized documentation foreach we can bring the knowledge to the worker right when they need it, limitingthe friction to accomplish their tasks and remain productive. A solution would:\n\u003Cbr\u003E \n\u003Cbr\u003E\n\u003Cbr\u003E * \u0026nbsp;Identifythe different personas interacting with the custom solution\n\u003Cbr\u003E * \u0026nbsp;Createdocumentation supporting the unique needs of each persona\n\u003Cbr\u003E * \u0026nbsp;Defineintuitive information architecture to support each persona and their top tasks\n\u003Cbr\u003E * \u0026nbsp;Developon-demand playlists surfacing training documentation\n\u003Cbr\u003E * \u0026nbsp;Surface playlistsin-context of the custom solution (removing friction from end users’ ability tolocate training)"
            ]
          },
          {
            "name": "Success factors",
            "content": [
              "Bylimiting the friction to accomplish their tasks and remain productive,employees benefit from:\n\u003Cbr\u003E \n\u003Cbr\u003E\n\u003Cbr\u003E * \u0026nbsp;Areduction in the time to locate information.\n\u003Cbr\u003E * \u0026nbsp;Having documentation ofthe solution for their persona at their fingertips at the point of use"
            ]
          }
        ],
        "mediaAssets": [
          {
            "type": "image",
            "order": 0,
            "url": "assets/Custom Documentation.png",
            "alt": ""
          }
        ],
        "detailItemCategories": [
          {
            "name": "Resources",
            "description": "Possible html supported text shown just above the list of links",
            "items": []
          }
        ]
      }
    }
  }
}