{
  "solutionId": "meeting-assistant",
  "partnerId": "cognizant",
  "categories": [],
  "industries": [
    "Cross-Industry"
  ],
  "servicesUsed": [
    "Azure",
    "Graph API",
    "SharePoint sites"
  ],
  "sortOrder": 0,
  "preview": false,
  "visible": false,
  "solutionLogoPicture": null,
  "solutionLogoPictureAlt": "",
  "solutionName": "Meeting Assistant",
  "solutionUrl": null,
  "solutionUrlTitle": "Meeting Assistant",
  "metadata": {
    "personas": "Business Users",
    "businessFunctions": null,
    "businessValue": "* \u0026nbsp;The solution helps in improving the day-to-day productivity andefficiency\n\u003Cbr\u003E * \u0026nbsp;This also increases MS Teams adoption as users were interested in someenterprise wide solution helping their productivity",
    "displayPartner": false,
    "appSource": null,
    "displayInfo": {
      "default": {
        "descriptionParagraphs": [
          {
            "name": "Short description",
            "content": []
          },
          {
            "name": "Long description",
            "content": []
          },
          {
            "name": "Business need or problem",
            "content": [
              "Considering the volume of daily meetingshappening between Novartis associates today, there is an opportunity to be moreefficient with overall Meeting management Planning, managing and trackinginformation across various meetings.\n\u003Cbr\u003ETeams provides basic note takingcapabilities, but it needs to be further extended with utilities to optimizeoverall meeting management by individuals. This solution fills this gap. \n\u003Cbr\u003EThis cannot only improve productivity butalso increases MS Teams adoption"
            ]
          },
          {
            "name": "Business solution",
            "content": [
              "The proposed solution will leverage SPFx basedApp hosted on MS Teams tab, which have interactive interface to create andmanage meetings in MS teams. \n\u003Cbr\u003EScheduling a meeting: \n\u003Cbr\u003E\n\u003Cbr\u003E * \u0026nbsp;Along with OOTB meeting scheduling features, there will be option totrack Meeting agenda as metadata. All the relevant notes/action items can betracked against the Agenda.\n\u003Cbr\u003E * \u0026nbsp;Attachments are stored in OneDrive for Business so that large files canalso be added as part of meeting invite\n\u003Cbr\u003E * \u0026nbsp;The tool generates a well-formatted and structured email invitecontaining all the meeting details that is sent to the meeting participants.\n\u003Cbr\u003E\n\u003Cbr\u003EJoin a Meeting:\n\u003Cbr\u003E\n\u003Cbr\u003E * \u0026nbsp;The meeting participant has a one-stop access to relevant meetinginformation like participants, meeting agenda and reference material upfront ina structured and organized manner for ease of use\n\u003Cbr\u003E * \u0026nbsp;As a meeting participant, the tool provides an option to co-authormeeting notes. The tool also provides user with a voice-assisted feature tocapture meeting notes for ease of use. User also has the option to organizemeeting minutes by agenda for effective circulation and tracking\n\u003Cbr\u003E * \u0026nbsp;With an single click host can publishes the meeting minutes to allparticipants that receive the minutes in a formatted and structured emailcontaining all the meeting details\n\u003Cbr\u003E * \u0026nbsp;All action items and their status get tracked centrally in Planner"
            ]
          },
          {
            "name": "Success factors",
            "content": [
              "* \u0026nbsp;The solution was accepted as a Global tool and it created new initiativesin MS Teams development viz. One Conference solution on MS Teams etc.\n\u003Cbr\u003E * \u0026nbsp;The solution built our capability in MS teams development and usage ofGraph API, learning form which will help in future solution development"
            ]
          }
        ],
        "mediaAssets": [],
        "detailItemCategories": [
          {
            "name": "Resources",
            "description": "Possible html supported text shown just above the list of links",
            "items": []
          }
        ]
      }
    }
  }
}