{
  "partnerId": "videolink-llc",
  "categories": [],
  "industries": [],
  "solutions": null,
  "sortOrder": 0,
  "preview": false,
  "visible": false,
  "logoPicture": null,
  "logoPictureAlt": "",
  "heroPicture": "assets/hero.png",
  "featuredPicture": "assets/featured.png",
  "partnerName": "VideoLink LLC",
  "mpnId": "0",
  "metadata": {
    "displayInfo": {
      "default": {
        "shortDescription": "\u003Cdiv\u003E\u003Cspan style=\u0022font-size:10.5pt;font-family:\u0026quot;Segoe UI\u0026quot;,sans-serif;color:black;background:white;\u0022\u003EVideoLink, an AVI-SPL company, is a leading\nprovider of video and tech-enabled production services from any lens to any\nscreen® to Fortune 500, financial services, enterprise companies, and\ninstitutions.\u003C/span\u003E\u003Cbr\u003E\u003C/div\u003E",
        "featuredTitle": "Our Products \u0026 Services",
        "featuredParagraphs": [
          "\u003Cdiv\u003E\u003Ca href=\u0022https://www.videolinktv.com/virtualeventproductions/\u0022\u003EVirtual \u0026amp; Hybrid Events\u003C/a\u003E - You have a vision for your virtual or hybrid\nevent. As your trusted advisors, our creative and production experts help\nyou\u0026nbsp;shape that vision into a best-in-class experience from concept to\nbroadcast. \u003Cbr\u003E\u003C/div\u003E",
          "\u003Cdiv\u003E\u003Ca href=\u0022https://www.videolinktv.com/products-services/video-production-services/\u0022\u003EVideo Production\nServices\u003C/a\u003E\u0026nbsp;- There is a reason why\nVideoLink is the preferred choice of broadcast networks and corporate\nenterprise video customers everywhere. VideoLink provides everything needed to\nensure that your event is flawless from pre-production to post-production. Whether\nyou are looking for on-location, in-studio, fully virtual or hybrid, broadcast,\nor live streaming video services, VideoLink\u0027s team of experienced production\nprofessionals will deliver high-quality results that exceed your expectations. \u003Cbr\u003E\u003C/div\u003E",
          "\u003Cdiv\u003E\u003Ca href=\u0022https://www.videolinktv.com/products-services/readycam/\u0022\u003EReadyCam® Studio\u003C/a\u003E\u0026nbsp;-\u0026nbsp;The VideoLink ReadyCam HD broadcast studio is\nan all-in-one solution with remote operational support. This single-camera\nstudio is the simplest solution for doing live interviews or making broadcast-quality\nvideo. With\n24/7 support and no need for technical staff, every ReadyCam Studio reflects\nVideoLink’s two decades of experience in connecting experts to the world’s\ntelevision networks and broadcasting their message to multiple platforms,\nincluding Microsoft Teams Live Events.\u003Cbr\u003E\u003C/div\u003E"
        ],
        "callToAction": {
          "title": "From any lens to any screen® let’s bring your video vision to life.",
          "description": "Whether broadcasting from Teams or VideoLink’s ReadyCam Studio, we can connect, combine, and create a dynamic production for your audience.",
          "url": "https://www.videolinktv.com/virtualeventproductions/"
        },
        "mediaAssets": [
          {
            "type": "image",
            "order": 0,
            "url": "assets/Featured.png",
            "alt": ""
          },
          {
            "type": "image",
            "order": 1,
            "url": "assets/Hero.png",
            "alt": ""
          }
        ],
        "detailItemCategories": []
      }
    }
  }
}