{
  "partnerId": "videolink-llc",
  "categories": [],
  "industries": [],
  "solutions": null,
  "sortOrder": 0,
  "preview": false,
  "visible": false,
  "logoPicture": null,
  "logoPictureAlt": "",
  "heroPicture": "assets/Hero.png",
  "featuredPicture": "assets/Featured.png",
  "partnerName": "VideoLink LLC, an AVI-SPL Company",
  "mpnId": null,
  "metadata": {
    "displayInfo": {
      "default": {
        "shortDescription": "VideoLink, an AVI-SPL company, is a leadingprovider of video and tech-enabled production services from any lens to anyscreen® to Fortune 500, financial services, enterprise companies, andinstitutions.",
        "featuredTitle": "Our Products \u0026 Services",
        "featuredParagraphs": [
          "\u003Cdiv\u003E\u003Ca href=\u0022https://www.videolinktv.com/virtualeventproductions/\u0022\u003EVirtual \u0026amp; Hybrid Events\u003C/a\u003E - You have a vision for your virtual or hybridevent. As your trusted advisors, our creative and production experts helpyou shape that vision into a best-in-class experience from concept tobroadcast. \u003C/div\u003E",
          "\u003Cdiv\u003E\u003Ca href=\u0022https://www.videolinktv.com/products-services/video-production-services/\u0022\u003EVideo ProductionServices\u003C/a\u003E - There is a reason whyVideoLink is the preferred choice of broadcast networks and corporateenterprise video customers everywhere. VideoLink provides everything needed toensure that your event is flawless from pre-production to post-production. Whetheryou are looking for on-location, in-studio, fully virtual or hybrid, broadcast,or live streaming video services, VideoLink\u0027s team of experienced productionprofessionals will deliver high-quality results that exceed your expectations. \u003C/div\u003E",
          "\u003Cdiv\u003E\u003Ca href=\u0022https://www.videolinktv.com/products-services/readycam/\u0022\u003EReadyCam® Studio\u003C/a\u003E - The VideoLink ReadyCam HD broadcast studio isan all-in-one solution with remote operational support. This single-camerastudio is the simplest solution for doing live interviews or making broadcast-qualityvideo. With24/7 support and no need for technical staff, every ReadyCam Studio reflectsVideoLink’s two decades of experience in connecting experts to the world’stelevision networks and broadcasting their message to multiple platforms,including Microsoft Teams Live Events. \u003C/div\u003E"
        ],
        "callToAction": {
          "title": "From any lens to any screen® let’s bring your video vision to life.",
          "description": "Whether broadcasting from Teams or VideoLink’s ReadyCam Studio, we can connect, combine, and create a dynamic production for your audience.",
          "url": "https://www.videolinktv.com/virtualeventproductions/"
        },
        "mediaAssets": [
          {
            "type": "image",
            "order": 0,
            "url": "assets/Hero.png",
            "alt": ""
          },
          {
            "type": "image",
            "order": 1,
            "url": "assets/Featured.png",
            "alt": ""
          }
        ],
        "detailItemCategories": [],
        "contact": null
      }
    }
  }
}