{
  "partnerId": "365-akademie",
  "categories": [],
  "industries": [],
  "solutions": null,
  "sortOrder": 0,
  "preview": false,
  "visible": true,
  "logoPicture": null,
  "logoPictureAlt": "",
  "heroPicture": "assets/Hero.png",
  "featuredPicture": "assets/Featured.png",
  "partnerName": "365 Akademie",
  "mpnId": null,
  "metadata": {
    "displayInfo": {
      "default": {
        "shortDescription": "365 Akademie supports your employees with monthly new learning videos – short, simple to follow and use case based - to learn new digital skills and experience modern work with Microsoft 365. – Stay updated!",
        "featuredTitle": "More productive with Microsoft 365",
        "featuredParagraphs": [
          "“How do users work more productive with Microsoft 365 and how do they find out about the benefits, new features and possible use cases?” - \u0026nbsp;That is the question the 365 Akademie wants to answer. \u0026nbsp;\u0026nbsp;\n\u003Cbr\u003E \n\u003Cbr\u003EWith the 365 Akademie as a learning partner, your employees stay up to date with monthly new learning videos. The learning nuggets are use case based and support the knowledge transfer into practice. \u0026nbsp;\u0026nbsp;\n\u003Cbr\u003E \n\u003Cbr\u003EThe 365 Akademie supports your champions program and provides its learning videos in Microsoft Teams. The content is available in German and English (more languages as subtitles). Next to the monthly updated learning videos for all the Microsoft 365 Apps, the 365 Akademie implements learning pathways into your intranet, SharePoint sites or your LMS."
        ],
        "callToAction": {
          "title": "Learn more about the 365 Akademie",
          "description": "Experience modern work with our learning service and learn how the 365 Akademie supports you to achieve more",
          "url": "https://www.365akademie.de/"
        },
        "mediaAssets": [
          {
            "type": "image",
            "order": 0,
            "url": "assets/Hero.png",
            "alt": ""
          },
          {
            "type": "image",
            "order": 1,
            "url": "assets/Featured.png",
            "alt": ""
          }
        ],
        "detailItemCategories": [],
        "contact": "Dominik Ammann"
      }
    }
  }
}