{
  "partnerId": "planet-technologies",
  "categories": [],
  "industries": [],
  "solutions": null,
  "sortOrder": 0,
  "preview": false,
  "visible": true,
  "logoPicture": null,
  "logoPictureAlt": "",
  "heroPicture": null,
  "featuredPicture": "assets/featured.png",
  "partnerName": "Planet Technologies",
  "mpnId": "0",
  "metadata": {
    "displayInfo": {
      "default": {
        "shortDescription": "\u003Cdiv\u003E\u003Cspan style=\u0022font-size:12.0pt;font-family:\u0026quot;Calibri\u0026quot;,sans-serif;\u0022\u003EPlanet Technologies is a leading provider of\nMicrosoft consulting services across the United States, supporting the public\nsector as well as education, health and commercial organizations.\u003C/span\u003E\u003Cbr\u003E\u003C/div\u003E",
        "descriptionParagraphs": [
          "\u003Cdiv\u003E\u003Cp style=\u0022margin:0px 0px 10px;box-sizing:border-box;font-family:SegoeUI;font-size:16px;color:rgb(51, 51, 51);\u0022\u003ENew technology doesn’t work if your people don’t know how to use it. And, deployment is not adoption. If our IT projects were based solely on the deployment of the technology and could ignore the human factor - implementing new solutions would be the easiest task we ever took on!\u003C/p\u003E\u003C/div\u003E",
          "\u003Cdiv style=\u0022margin:0px 0in;font-size:12pt;font-family:Calibri, sans-serif;\u0022\u003E\u003Cspan style=\u0022color:rgb(51, 51, 51);font-family:SegoeUI;display:inline !important;\u0022\u003EThe Evolve 365 custom learning program and our Learning Strategists understand the full scope of new technology updates and deployments. We dig into the details of how to prepare and manage them so you don’t have to. This allows you and your team to focus on your work and productivity. In the hybrid workforce world, we have learned it is very different from the past and many things that we have depended on for years, don’t provide the same value now as they previously had. We must adjust our entire approach to keep up to date and meet the needs of this growing workforce. Flexibility is a core piece of this program to meet these different and ever changing needs and future proof your workforce. With all this in mind, Planet Technologies created Evolve 365.\u003C/span\u003E\u003Cbr\u003E\u003C/div\u003E",
          "\u003Cdiv\u003E\u003Cspan style=\u0022color:rgb(51, 51, 51);font-family:SegoeUI;font-size:16px;display:inline !important;\u0022\u003EEvolve 365 is a customized learning and adoption program that aligns with the specific needs and culture of your users. Evolve 365 includes a dedicated Learning Strategist familiar with user adoption, the changes of Office 365, and driving users to embrace new technology. Here are just a few ways Evolve 365 works for you and your team: Micro-Training Videos, Training \u0026amp; Communication Plans, Custom Playlists, Monthly Office Hours, Communication Campaigns, and Ongoing Usage \u0026amp; Adoption Analysis.\u003C/span\u003E\u003Cbr\u003E\u003C/div\u003E"
        ],
        "mediaAssets": [
          {
            "type": "image",
            "order": 0,
            "url": "assets/Hero.jpg",
            "alt": ""
          },
          {
            "type": "image",
            "order": 1,
            "url": "assets/Featured.png",
            "alt": ""
          }
        ],
        "detailItemCategories": []
      }
    }
  }
}