{
  "solutionId": "livetileseverywherepanel",
  "partnerId": "livetiles",
  "categories": [
    "teams"
  ],
  "industries": [],
  "servicesUsed": [
    "Azure AD",
    "Azure SQL Service",
    "Azure Web App Service",
    "Microsoft Teams",
    "SharePoint API",
    "SPFx"
  ],
  "sortOrder": 0,
  "preview": false,
  "visible": true,
  "solutionLogoPicture": null,
  "solutionLogoPictureAlt": "",
  "solutionName": "LiveTiles Everywhere",
  "solutionUrl": "https://livetilesglobal.com/products/livetiles-everywhere/",
  "solutionUrlTitle": "LiveTiles Everywhere",
  "metadata": {
    "personas": "Corporate Communications;End-user;HR;IT;Knowledge Worker",
    "businessFunctions": "Adoption;Engagement",
    "businessValue": "LiveTiles Everywhere breaks silos and delivers users the content \u0026amp; tools they need to get work done in an engaging dashboard in MS teams.\n\u003Cbr\u003E\n\u003Cbr\u003EEmployees:\n\u003Cbr\u003E\n\u003Cbr\u003E * \u0026nbsp;Get corporate news and alerts delivered in a personalized and targeted feed in MS Teams.\n\u003Cbr\u003E * \u0026nbsp;Benefit from an instant access to relevant links and productivity tools.\n\u003Cbr\u003E * \u0026nbsp;Can quickly get the overview of everything relevant for their workday while collaborating in MS Teams.\n\u003Cbr\u003E * \u0026nbsp;The mobile access of MS Teams enables users to log on and stay connected via Everywhere in Teams from all places and devices.\n\u003Cbr\u003E\n\u003Cbr\u003ECorporate communications \u0026amp; HR:\n\u003Cbr\u003E\n\u003Cbr\u003E * \u0026nbsp;Can reach users across teams, divisions, and locations in the dynamic context of MS Teams.\n\u003Cbr\u003E * \u0026nbsp;Can make corporate messages cut through the noise of emails and MS Teams chat silos.\n\u003Cbr\u003E * \u0026nbsp;Can employ the sophisticated targeting options of Everywhere to create a highly relevant feed of news to each user.\n\u003Cbr\u003E * \u0026nbsp;Can ensure employees receive important information to be compliant and up to date with company product and service information.\n\u003Cbr\u003E * \u0026nbsp;Get a tool to get through to employees to drive company culture, engagement, and build employee advocacy and retention.\n\u003Cbr\u003E\n\u003Cbr\u003EIT:\n\u003Cbr\u003E\n\u003Cbr\u003E * \u0026nbsp;Can deliver users relevant productivity tools and services at their fingertips. Thereby enabling productivity and discouraging users from employing shadow IT.",
    "displayPartner": false,
    "appSource": null,
    "displayInfo": {
      "default": {
        "descriptionParagraphs": [
          {
            "name": "Short description",
            "content": [
              "LiveTiles Everywhere is an enterprise intranet with Microsoft Teams, letting you effortlessly slide between core business tools while working on-the-go in Microsoft Teams and SharePoint."
            ]
          },
          {
            "name": "Long description",
            "content": [
              "\u003Cdiv\u003E\u003Cspan style=\u0022display:inline !important;\u0022\u003EEverywhere seamlessly integrates with your SharePoint and Teams environments. Universally available from the left-hand side in SharePoint and the header in Teams, Everywhere unites your intranet with this power-couple of platforms. Presenting an enterprise intranet with MS Teams.\u003C/span\u003E\u003Cbr\u003E \u003C/div\u003E"
            ]
          },
          {
            "name": "Business need or problem",
            "content": [
              "With a workforce of:\n\u003Cbr\u003E\n\u003Cbr\u003E * \u0026nbsp;80% non-desk workers,\n\u003Cbr\u003E * \u0026nbsp;mobile employees,\n\u003Cbr\u003E * \u0026nbsp;and users that expect mobile and consumer-grade content,\n\u003Cbr\u003E\n\u003Cbr\u003Ewe see a workforce that is less tied to a desk during their workday and less likely to visit an intranet front page.\n\u003Cbr\u003E\n\u003Cbr\u003EKeeping employees up-to-date with the latest corporate content, business tools and curated content for specific audiences and groups can, therefore, be a challenge. According to Forrester, “a lower percentage of global information workers say that they’re satisfied with their employee intranet or company portal than with any other productivity tool”*. We see internal communications teams struggling with getting users to interact with corporate content. And we see more and more users turning to the engaging and interactive interface of Teams, on behalf of other applications.\n\u003Cbr\u003E\n\u003Cbr\u003EThis brings a challenge for Communications and HR teams that need to inform the entire workforce with news and important information, ensure everyone is compliant with company practices and the latest information about products and services, create a common company culture, create advocates among employees and ensure high retention rates.\n\u003Cbr\u003E\n\u003Cbr\u003EIT is challenged by people getting lost in the fragmented landscape of the digital workplace, not employing the tools recommended by IT and, in some instances, even employing shadow IT. This doesn’t just negatively affect productivity but can make up a risk for the IT security.\n\u003Cbr\u003E\n\u003Cbr\u003E*Forrester, “Your Intranet Is Dead: Reboot Communication And Collaboration With Employees At The Center” by Cheryl McKinnon, July 25, 2019"
            ]
          },
          {
            "name": "Business solution",
            "content": [
              "LiveTiles Everywhere brings the power and reach of a corporate intranet to the familiar interface of Microsoft Teams.\n\u003Cbr\u003E\n\u003Cbr\u003EBy providing an ‘ever present’ panel within Microsoft Teams, Everywhere lifts content and tools from silos and enables your employees to swiftly navigate internal sources and applications. You no longer “go to the intranet”. With LiveTiles Everywhere you deliver an experience that sits within Microsoft Teams.\n\u003Cbr\u003E\n\u003Cbr\u003EUsing system integrations and flows, you can collect information and tools from third-party applications and bring everything together in the LiveTiles Everywhere Panel. Making Everywhere serve as the one-stop digital workplace hub.\n\u003Cbr\u003E\n\u003Cbr\u003EWith targeting, you enable employees to summon the right tool from across the digital workplace, at the exact time they need it. Ensuring IT approved tools are easily found and utilized by employees.\n\u003Cbr\u003E\n\u003Cbr\u003ELight up and launch the most relevant corporate content and business functionality, as well as revealing business apps, personal links services menus and more ‘curated’ experiences at the click of a button.\n\u003Cbr\u003E\n\u003Cbr\u003ELiveTiles Everywhere delivers:\n\u003Cbr\u003E\n\u003Cbr\u003E * \u0026nbsp;A homepage that allows you to greet users with a branded experience in the panel.\n\u003Cbr\u003E * \u0026nbsp;Your entire digital workplace displayed beautifully, right where your users are.\n\u003Cbr\u003E * \u0026nbsp;A targeted, personalized, and security trimmed overview of content and tools across all systems that ensures relevancy and deliver exactly what people needs to be informed and get work done.\n\u003Cbr\u003E * \u0026nbsp;Completely configurable, the panel is designed to custom fit every business."
            ]
          },
          {
            "name": "Success factors",
            "content": [
              "* \u0026nbsp;LiveTiles Everywhere offers one corporate dashboard across teams, divisions, and locations. This enables Microsoft Teams to be the hub where people go to, not only to collaborate in teams, but to connect with the whole company and have all resources at their fingertips. This leverages Microsoft Teams as the center of the digital workplace that offers collaboration, access to productivity tools, as well as access to a targeted feed of centrally governed company news and information.\n\u003Cbr\u003E * \u0026nbsp;Post the first wave of the COVID-19 pandemic and with the trends we see with workplaces moving towards hybrid ways of working, enablement and engagement of remote working people has been a priority for businesses. Everywhere helps Microsoft Teams offer a complete platform to inform, enable, and engage employees in any location.\n\u003Cbr\u003E * \u0026nbsp;We understand the importance of a smooth installation. As a ready-to-run solution that can be customized, Everywhere offers businesses the advantage of instant business value as well as the option of adjusting the solution to unique needs."
            ]
          }
        ],
        "mediaAssets": [
          {
            "type": "image",
            "order": 0,
            "url": "assets/Everywhere_MS_Image_2.png",
            "alt": ""
          }
        ],
        "detailItemCategories": [
          {
            "name": "Resources",
            "description": "Possible html supported text shown just above the list of links",
            "items": []
          }
        ]
      }
    }
  }
}