{
  "solutionId": "livetileseverywherepanel",
  "partnerId": "livetiles",
  "categories": [
    "teams"
  ],
  "industries": [],
  "sortOrder": 0,
  "preview": false,
  "visible": true,
  "solutionLogoPicture": null,
  "solutionLogoPictureAlt": "",
  "solutionName": "LiveTiles Everywhere",
  "solutionUrl": "https://livetilesglobal.com/products/livetiles-everywhere/",
  "solutionUrlTitle": "LiveTiles Everywhere",
  "metadata": {
    "personas": "Corporate Communications;End-user;HR;IT;Knowledge Worker",
    "solutionTechnologies": "Azure AD;Azure SQL Service;Azure Web App Service;Microsoft Teams;SharePoint API;SPFx",
    "businessFunctions": "Adoption;Engagement",
    "displayInfo": {
      "default": {
        "descriptionParagraphs": [
          {
            "name": "Short description",
            "content": [
              "\u003Cdiv\u003ELiveTiles Everywhere is an enterprise intranet with Microsoft Teams, letting you effortlessly slide between core business tools while working on-the-go in Microsoft Teams and SharePoint.\u003Cbr\u003E\u003C/div\u003E"
            ]
          },
          {
            "name": "Business need or problem",
            "content": [
              "\u003Cdiv\u003EWith a workforce of:\u003C/div\u003E\u003Cdiv\u003E\u003Cul\u003E\u003Cli\u003E80% non-desk workers,\u003C/li\u003E\u003Cli\u003Emobile employees,\u003C/li\u003E\u003Cli\u003Eand users that expect mobile and consumer-grade content,\u003C/li\u003E\u003C/ul\u003E\u003C/div\u003E\u003Cdiv\u003Ewe see a workforce that is less tied to a desk during their workday and less likely to visit an intranet front page.\u003Cbr style=\u0022box-sizing:border-box;font-family:SegoeUI;color:rgb(51, 51, 51);font-size:16px;text-align:left;\u0022\u003E\u003C/div\u003E\u003Cdiv\u003E\u003Cbr style=\u0022box-sizing:border-box;font-family:SegoeUI;color:rgb(51, 51, 51);font-size:16px;text-align:left;\u0022\u003E\u003C/div\u003E\u003Cdiv\u003EKeeping employees up-to-date with the latest corporate content, business tools and curated content for specific audiences and groups can, therefore, be a challenge. According to Forrester, “a lower percentage of global information workers say that they’re satisfied with their employee intranet or company portal than with any other productivity tool”*. We see internal communications teams struggling with getting users to interact with corporate content. And we see more and more users turning to the engaging and interactive interface of Teams, on behalf of other applications.\u003Cbr style=\u0022box-sizing:border-box;font-family:SegoeUI;color:rgb(51, 51, 51);font-size:16px;text-align:left;\u0022\u003E\u003C/div\u003E\u003Cdiv\u003E\u003Cbr style=\u0022box-sizing:border-box;font-family:SegoeUI;color:rgb(51, 51, 51);font-size:16px;text-align:left;\u0022\u003E\u003C/div\u003E\u003Cdiv\u003EThis brings a challenge for Communications and HR teams that need to inform the entire workforce with news and important information, ensure everyone is compliant with company practices and the latest information about products and services, create a common company culture, create advocates among employees and ensure high retention rates.\u003Cbr style=\u0022box-sizing:border-box;font-family:SegoeUI;color:rgb(51, 51, 51);font-size:16px;text-align:left;\u0022\u003E\u003C/div\u003E\u003Cdiv\u003E\u003Cbr style=\u0022box-sizing:border-box;font-family:SegoeUI;color:rgb(51, 51, 51);font-size:16px;text-align:left;\u0022\u003E\u003C/div\u003E\u003Cdiv\u003EIT is challenged by people getting lost in the fragmented landscape of the digital workplace, not employing the tools recommended by IT and, in some instances, even employing shadow IT. This doesn’t just negatively affect productivity but can make up a risk for the IT security.\u003Cbr style=\u0022box-sizing:border-box;font-family:SegoeUI;color:rgb(51, 51, 51);font-size:16px;text-align:left;\u0022\u003E\u003C/div\u003E\u003Cdiv\u003E\u003Cbr style=\u0022box-sizing:border-box;font-family:SegoeUI;color:rgb(51, 51, 51);font-size:16px;text-align:left;\u0022\u003E\u003C/div\u003E\u003Cdiv\u003E*Forrester, “Your Intranet Is Dead: Reboot Communication And Collaboration With Employees At The Center” by Cheryl McKinnon, July 25, 2019\u003Cbr\u003E\u003C/div\u003E"
            ]
          },
          {
            "name": "Business solution",
            "content": [
              "\u003Cdiv\u003ELiveTiles Everywhere brings the power and reach of a corporate intranet to the familiar interface of Microsoft Teams.\u003Cbr style=\u0022box-sizing:border-box;\u0022\u003E\u003C/div\u003E\u003Cdiv\u003E\u003Cbr style=\u0022box-sizing:border-box;\u0022\u003E\u003C/div\u003E\u003Cdiv\u003EBy providing an ‘ever present’ panel within Microsoft Teams, Everywhere lifts content and tools from silos and enables your employees to swiftly navigate internal sources and applications. You no longer “go to the intranet”. With LiveTiles Everywhere you deliver an experience that sits within Microsoft Teams.\u003Cbr style=\u0022box-sizing:border-box;\u0022\u003E\u003C/div\u003E\u003Cdiv\u003E\u003Cbr style=\u0022box-sizing:border-box;\u0022\u003E\u003C/div\u003E\u003Cdiv\u003EUsing system integrations and flows, you can collect information and tools from third-party applications and bring everything together in the LiveTiles Everywhere Panel. Making Everywhere serve as the one-stop digital workplace hub.\u003Cbr style=\u0022box-sizing:border-box;\u0022\u003E\u003C/div\u003E\u003Cdiv\u003E\u003Cbr style=\u0022box-sizing:border-box;\u0022\u003E\u003C/div\u003E\u003Cdiv\u003EWith targeting, you enable employees to summon the right tool from across the digital workplace, at the exact time they need it. Ensuring IT approved tools are easily found and utilized by employees.\u003Cbr style=\u0022box-sizing:border-box;\u0022\u003E\u003C/div\u003E\u003Cdiv\u003E\u003Cbr style=\u0022box-sizing:border-box;\u0022\u003E\u003C/div\u003E\u003Cdiv\u003ELight up and launch the most relevant corporate content and business functionality, as well as revealing business apps, personal links services menus and more ‘curated’ experiences at the click of a button.\u003Cbr style=\u0022box-sizing:border-box;\u0022\u003E\u003C/div\u003E\u003Cdiv\u003E\u003Cbr style=\u0022box-sizing:border-box;\u0022\u003E\u003C/div\u003E\u003Cdiv\u003ELiveTiles Everywhere delivers:\u003C/div\u003E\u003Cdiv\u003E\u003Cul\u003E\u003Cli\u003EA homepage that allows you to greet users with a branded experience in the panel.\u003C/li\u003E\u003Cli\u003EYour entire digital workplace displayed beautifully, right where your users are.\u003C/li\u003E\u003Cli\u003EA targeted, personalized, and security trimmed overview of content and tools across all systems that ensures relevancy and deliver exactly what people needs to be informed and get work done.\u003C/li\u003E\u003Cli\u003ECompletely configurable, the panel is designed to custom fit every business.\u003C/li\u003E\u003C/ul\u003E\u003C/div\u003E\u003Cdiv\u003E\u003Cbr\u003E\u003C/div\u003E"
            ]
          }
        ],
        "mediaAssets": [
          {
            "type": "image",
            "order": 0,
            "url": "assets/Everywhere_MS_Image_2.png",
            "alt": ""
          }
        ],
        "detailItemCategories": [
          {
            "name": "Resources",
            "description": "Possible html supported text shown just above the list of links",
            "items": []
          }
        ]
      }
    }
  }
}