{
  "partnerId": "powell-software",
  "categories": [],
  "industries": [],
  "solutions": null,
  "sortOrder": 0,
  "preview": false,
  "visible": true,
  "logoPicture": null,
  "logoPictureAlt": "",
  "heroPicture": "assets/Hero.png",
  "featuredPicture": "assets/Featured.png",
  "partnerName": "Powell Software",
  "mpnId": "6019912",
  "metadata": {
    "displayInfo": {
      "default": {
        "shortDescription": "Powell Software’s mission is to help companies meet the challenges ofthe hybrid workplace while promoting inclusivity for all employees thanks tocollaboration tools that are easily accessible to all.",
        "featuredTitle": "Powell Teams, A modern collaboration experience that is effortless, organized, easy to manage and governed.",
        "featuredParagraphs": [
          "Powell Teams is thecollaboration pillar \u0026nbsp;of the Powell \u0026nbsp;365 Digital Workplace whichalso includes \u0026nbsp;Powell Intranet, thecommunication and employee engagement pillar. Powell Teams value proposition isaimed at all employees, and business functions, especially HR, internalcommunications and IT teams.\n\u003Cbr\u003E\n\u003Cbr\u003EFor Employees, Powell Teams enhances the userexperience by making it easier for users to access and search for the MicrosoftTeams to which they belong. Powell Teams offers an intuitive dashboard tofilter Teams based on business criteria. It also helps manage the proliferation of Teams. Powell Teams alsoguides users by offering ready-to-use Teams templates that allow users tocreate a complete team in 3 clicks. The Team comes loaded with channels, applications,and tabs.",
          "For IT, IT teams need tostrike the right balance between adopting Microsoft 365 to the businesscontext, making it easy for employees to use, and complying with the rules ofsecurity, compliance and good IT management. Powell Teams allows IT to set upan agile governance, defining criteria such as: \u0026nbsp;\n\u003Cbr\u003E\n\u003Cbr\u003E * \u0026nbsp;Namingrule and labels \n\u003Cbr\u003E * \u0026nbsp;Externalor internal, public, or private access rights \n\u003Cbr\u003E * \u0026nbsp;Numberof owners and team members \n\u003Cbr\u003E * \u0026nbsp;Expirationand archiving \n\u003Cbr\u003E * \u0026nbsp;Approvalprocess",
          "For internal communicationdepartments, Powell Teams enables access to the intranet within the businessteam where it is most relevant: \u0026nbsp;\u0026nbsp;forexample, the document repository for the Sales department is accessible in theform of a tab directly in each of the Sales RFP teams. Another example is thepage containing all the welcoming documents which is attached to the teamcreated to onboard a newcomer."
        ],
        "callToAction": {
          "title": "Request a demo today!",
          "description": "If you want more information about Powell Software products or to talk about your project, fill in the contact form and we will get back to you shortly.",
          "url": "https://powell-software.com/en/request-a-demo/"
        },
        "mediaAssets": [
          {
            "type": "image",
            "order": 0,
            "url": "assets/Hero.png",
            "alt": ""
          },
          {
            "type": "image",
            "order": 1,
            "url": "assets/Featured.png",
            "alt": ""
          }
        ],
        "detailItemCategories": [],
        "contact": "Matthieu Silbermann"
      }
    }
  }
}