{
  "solutionId": "teammate",
  "partnerId": "avanade",
  "categories": [
    "teams"
  ],
  "industries": [
    "Banking \u0026 Financial Services",
    "Healthcare",
    "Hospitality",
    "Manufacturing",
    "Quick Serve Restaurants",
    "Retail"
  ],
  "servicesUsed": [],
  "sortOrder": 0,
  "preview": false,
  "visible": false,
  "solutionLogoPicture": null,
  "solutionLogoPictureAlt": "",
  "solutionName": "Teammate",
  "solutionUrl": null,
  "solutionUrlTitle": "Teammate",
  "metadata": {
    "personas": "Front Line Worker;Manager",
    "businessFunctions": "Business Operations;Corporate Communications;Human Resources",
    "businessValue": "Employeewell-being and engagement\n\u003Cbr\u003E\n\u003Cbr\u003E * \u0026nbsp;Reassureemployees with a strong commitment to security and safety.\n\u003Cbr\u003E * \u0026nbsp;Providetools to maintain their health and well-being.\n\u003Cbr\u003E * \u0026nbsp;CaptureFLW feedback and build business agility to support the new normal.\n\u003Cbr\u003E\n\u003Cbr\u003ELearning and tasks\n\u003Cbr\u003E\n\u003Cbr\u003E * \u0026nbsp;Optimizeactivities to focus on an agile business.\n\u003Cbr\u003E * \u0026nbsp;Instantlyaccessible for the employee.\n\u003Cbr\u003E * \u0026nbsp;Trainworkers in automated activities to enable fast adaptation to changing needs.\n\u003Cbr\u003E\n\u003Cbr\u003ECommunication and culture\n\u003Cbr\u003E\n\u003Cbr\u003E * \u0026nbsp;Connect toteams and the broader organization in real-time.\n\u003Cbr\u003E * \u0026nbsp;Promoteyour company culture and increase employee engagement.\n\u003Cbr\u003E * \u0026nbsp;Facilitateongoing communication between employees, customers and partners.",
    "displayPartner": false,
    "appSource": null,
    "displayInfo": {
      "default": {
        "descriptionParagraphs": [
          {
            "name": "Short description",
            "content": []
          },
          {
            "name": "Long description",
            "content": []
          },
          {
            "name": "Business need or problem",
            "content": [
              "Frontline work is proving to be challenging.Workers and working practices are disconnected from other teams and the wider company. \u0026nbsp;While outdated, obsolete tools and processescreate inefficient communication and collaboration. \u0026nbsp;This makes cascading information,instructions, tasks and policy changes difficult to scale, validate and capturefeedback.\n\u003Cbr\u003ECompounding the problem is that corporatefunctions have no visibility into the efficacy of these communications, whilefrontline workers are often the last to receive information and resources. \u0026nbsp;Onboarding and training requirements becomemore cumbersome and manual and security practices and governance are uneven.\n\u003Cbr\u003E\n\u003Cbr\u003EThe net result is workers are isolated andanxious; agility is constrained. \u0026nbsp;Firstlineworkers are (like many other employee groups) anxious about their health. Istheir employer doing enough to look after them (and customers)? \u0026nbsp;Meanwhile, the business needs to evolve, to bemore agile, to be ready to adapt to change. This necessitates a digital transformation to enable a more dynamic model,vital to survive and thrive in today (and tomorrow)’s business. Getting buy-infrom the firstline worker community – the backbone of the company – on this journeyis key to success."
            ]
          },
          {
            "name": "Business solution",
            "content": [
              "Introducing Avanade WX Teammate! Teammatechanges the way organizations engage with their teams and frontline workers, byenabling consistent communication, protecting health and well-being, and providinga personalized view of tasks. \u0026nbsp;Teammatehelps organizations to increase engagement and morale as well as improving theoverall employee experience. \u0026nbsp;Teammatealso provides the platform to enable change, helping an organization capitalizeon the fast-evolving environments and react to business strategies and dynamicsquicker and more consistently.\n\u003Cbr\u003EA flexible, extensible platform\n\u003Cbr\u003EBuilt on the Microsoft Teams platform, Teammatesupports integration with many necessary components, including workforce andlearning management systems, HR \u0026amp; personnel systems, and the IT \u0026amp; facilitiesservice desks. \u0026nbsp;For example, Teammateprovides easy access to key third party systems like Service Desk, HR systems andCRM platforms – enabling the individual to quickly (and seamlessly) access thenecessary systems without context or the need to switch to another platform.\n\u003Cbr\u003EThrough the Microsoft Teams framework andMicrosoft Graph, AI and virtual assistants can augment an individual worker’s role,as well as delivering analytics and insight for the organization. \u0026nbsp;\n\u003Cbr\u003ETeammate is provided in a Solution as aService (SaaS) service model, which brings a consumption-based model across Avanade’sglobal managed services capability, encompassing our skills and experience inagile design, UX, and the Microsoft ecosystem.\n\u003Cbr\u003EBenefitting employees\n\u003Cbr\u003EFrontline workers gain easy access to theinformation needed. They can manage shifts, track tasks, follow the latestcorporate communications and social media or connect easily with HR, IT orfacilities – all from one app. \u0026nbsp;Meanwhile,they can rest assured that Teammate is also keeping their health and well-beingfront and centre. \u0026nbsp;\n\u003Cbr\u003EBenefitting the organization\n\u003Cbr\u003ECapitalize on a simpler, quicker way to cascadenews, updates, tasks, or training requirements. Gain improved visibility over shiftand task management as well as insight into performance and compliance."
            ]
          },
          {
            "name": "Success factors",
            "content": [
              "Developed with specific Customers / UseCases and updated regularly to respond to constantly evolving FLW situation andpriorities."
            ]
          }
        ],
        "mediaAssets": [],
        "detailItemCategories": [
          {
            "name": "Resources",
            "description": "Possible html supported text shown just above the list of links",
            "items": []
          }
        ]
      }
    }
  }
}