{
  "partnerId": "code-software",
  "categories": [],
  "industries": [],
  "solutions": null,
  "sortOrder": 0,
  "preview": false,
  "visible": true,
  "logoPicture": null,
  "logoPictureAlt": "",
  "heroPicture": "assets/hero.png",
  "featuredPicture": "assets/featured.png",
  "partnerName": "Code Software",
  "mpnId": "0",
  "metadata": {
    "displayInfo": {
      "default": {
        "shortDescription": "Code Software makes it easy to monitor, analyze,record and report on the performance of just about any aspect of your Teamsenvironment.",
        "featuredTitle": "Add a layer of clarity and understanding to your Teams environment.",
        "featuredParagraphs": [
          "We have the tools to analyze and manage call quality and service levels, raise productivity, increase user adoption, and plan with confidence across multiple elements of Teams for the highs and lows of a fast-moving business.\n\u003Cbr\u003EWe have the tools to analyze and manage call quality andservice levels, raise productivity, increase user adoption, and plan withconfidence across multiple elements of Teams for the highs and lows of afast-moving business.",
          "If you don’t know how your Teams environment is performing, you’re working blind. You don’t have the data to show whether customer service levels are up or down. You can’t tell if your problem fixes are working and you’ve no idea how well remote workers are performing. Code will assist you in working smarter together in a world of remote workers and geographically distributed teams.",
          "The principles of sharing and connectivity have worked for us. We now operate through a global network of 50\u002B strategic partners, and serve 3,000\u002B customers, from SMEs to the largest global organizations. Like our partners and customers, we work collaboratively and effectively across borders and time zones. Our HQ is in the UK, and we have two other busy offices in the US and Romania."
        ],
        "callToAction": {
          "title": "The Clobba suite is available on a free 30 day trial",
          "description": "Delivered either from the Code Cloud or in customer environments see firsthand the added value that Clobba can bring to a Teams environment. Contact us now on info@codesoftware.net or visit www.codesoftware.net",
          "url": "www.codesoftware.net"
        },
        "mediaAssets": [
          {
            "type": "image",
            "order": 0,
            "url": "assets/Featured.png",
            "alt": ""
          },
          {
            "type": "image",
            "order": 1,
            "url": "assets/Hero.png",
            "alt": ""
          }
        ],
        "detailItemCategories": [],
        "contact": null
      }
    }
  }
}