{
  "solutionId": "3ee373aa-62fa-4fc6-b11f-9627d5b4a73d",
  "partnerId": "4127203",
  "categories": [],
  "industries": [
    "Construction",
    "Cross-Industry",
    "Education",
    "Government",
    "Healthcare",
    "Legal and In-House Legal Manufacturing",
    "Professional Services",
    "Other",
    "Corporate Legal Departments, Law Firms"
  ],
  "servicesUsed": [
    "Azure",
    "Custom Tabs",
    "Graph API",
    "Messaging Extension",
    "Microsoft 365",
    "Microsoft Teams",
    "PnP Framework",
    "Power App",
    "Power Automate",
    "Search",
    "SharePoint API",
    "SharePoint sites"
  ],
  "sortOrder": 0,
  "preview": false,
  "visible": false,
  "solutionLogoPicture": null,
  "solutionLogoPictureAlt": "",
  "solutionName": "LawToolBox",
  "solutionUrl": null,
  "solutionUrlTitle": "LawToolBox",
  "metadata": {
    "personas": "Business User;IT Professional;Other;Corporate Legal Departments, Law Firms",
    "businessFunctions": "Adoption;Business Operations;Change Management;Governance;Project Management;Project Management Offices;Templates;",
    "businessValue": "Never miss a deadline: enjoy peace of mind with real-time notifications and automatic updates when court rules change. Save time with automation: save hours every week by automating the tedious task of calculating and calendaring rules-based deadlines. Eliminate human error: mistakes happen - protect your practice and make sure your deadlines are always 100% accurate. Reduce the risk of malpractice: missed deadlines are the #1 cause of malpractice. Earn a discount on your malpractice insurance premiums for reducing risk with electronic docketing.",
    "displayPartner": false,
    "appSource": "https://appsource.microsoft.com/en-us/product/office/lawtoolboxinc.lawtoolboxdeadlinesoutlook?tab=Overview",
    "displayInfo": {
      "default": {
        "descriptionParagraphs": [
          {
            "name": "Short description",
            "content": [
              "Use the #1 legal add-in for Microsoft 365 to instantly calculate rules-based deadlines and sync to any calendar in seconds."
            ]
          },
          {
            "name": "Long description",
            "content": [
              "Automate rules-based calendaring for a broad range of case actions in thousands of state and federal courts throughout the United States. Organize all of your emails, files, notes, and deadlines by matter across M365 apps. Easily create new matters, meetings, appointments, and contacts from your Outlook inbox then save files and emails to the related matter. Create shared workspaces, search files across your entire M365 tenant, and more.\r\n"
            ]
          },
          {
            "name": "Business need or problem",
            "content": [
              "According to the ABA, missed deadlines are the number one cause of malpractice, and lawyers have a 17% chance of being sued for malpractice each year. Manually calculating deadlines is a risky and tedious process that takes hours every week. Court rules can change and require constant monitoring to ensure your deadlines are accurate. There are numerous practice and case management platforms that can offer a variety of solutions, but many legal professionals spend their day inside Microsoft 365 and need an all-in-one solution for matter management in the software they currently use."
            ]
          },
          {
            "name": "Business solution",
            "content": [
              "Make your work easier with award-winning legal tools in Microsoft 365 and leading practice management platforms. Automatically calculate rules-based deadlines for any practice area with thousands of courts in all 50 states and countries worldwide. Customize or hide deadlines, and add to any calendar in seconds. Get notifications and instant calendar updates if court rules change. Manage cases and clients with powerful tools for intake, onboarding, contact management, and more in Microsoft Teams, Outlook and Sharepoint. Connect the patented rules-based deadline calculator to leading practice, case, and document management platforms. Enable the LawToolBox automated calendaring integration to centralize docketing and easily automate time-consuming tasks in your existing software. Save time, eliminate human error, and reduce the risk of malpractice with matter management inside Microsoft Teams and Outlook."
            ]
          },
          {
            "name": "Success factors",
            "content": [
              "Law firms and legal departments can easily enable the LawToolBox add-in from Microsoft Teams marketplace or in their Outlook inbox to immediately gain access to all the features and tools available. Users can take a product tour, begin a free trial, or signup and add to their Microsoft Invoice from the commercial marketplace. With an award-winning, intuitive interface and expert customer support, legal professionals can quickly begin to automate their legal calendaring and manage matters more effectively within their existing Microsoft 365 tenant."
            ]
          }
        ],
        "mediaAssets": [
          {
            "type": "image",
            "order": 0,
            "url": "assets/Hero.png",
            "alt": ""
          }
        ],
        "detailItemCategories": [
          {
            "name": "Resources",
            "description": "Possible html supported text shown just above the list of links",
            "items": []
          }
        ]
      }
    }
  }
}