{
  "solutionId": "teams-manager",
  "partnerId": "solutions2share",
  "categories": [
    "teams"
  ],
  "industries": [
    "Cross-Industry"
  ],
  "servicesUsed": [
    "Azure Bot",
    "Azure Web App Service",
    "Graph API",
    "React",
    "Teams Tabs"
  ],
  "sortOrder": 0,
  "preview": false,
  "visible": true,
  "solutionLogoPicture": null,
  "solutionLogoPictureAlt": "",
  "solutionName": "Teams Manager",
  "solutionUrl": "https://www.solutions2share.com/teams-manager/",
  "solutionUrlTitle": "Teams Manager",
  "metadata": {
    "personas": "Administrators;Corporate Communications;IT Admin",
    "businessFunctions": "Adoption;Governance;Project Management;Templates",
    "businessValue": "Inthe words of our customers:\n\u003Cbr\u003E\n\u003Cbr\u003E\u0026quot;Ithink the Teams Manager is an ingenious tool, which covers the current gaps of O365teams with its functions. Due to the self-explanatory user interface anddetailed documentation, the Teams Manager is ready for use in a few hours.Unbeatable price performance. In addition, with colleagues from Solutions2Shareyou have a fast reacting partner with whom friendly communication at eye levelis always fun.\u0026quot;\n\u003Cbr\u003ETimBenkel, Team Lead Process IT Consulting at Bechtle GmbH \u0026amp; Co. KG\n\u003Cbr\u003E\n\u003Cbr\u003E \u0026quot;Weare very pleased with Teams Manager. Since we started using it we have alreadycreated ∼800Teams with it. The business received the approval process well and haveappreciated the advise we give them when the request is denied.\u0026quot;\n\u003Cbr\u003EDavidOwen, Head of IT Global Services at Bruker AXS LLC\n\u003Cbr\u003E\n\u003Cbr\u003E\u0026quot;Sinceintegrating Teams Manager into our Teams Client, giving our users thepossibility to effortlessly create Teams from a predefined set of templates, wefinally got to a set and strict process of governing Teams while alsogenerating a great overview and control over all created Teams.\u0026quot;\n\u003Cbr\u003ETim Baumgartl, Software Engineer at AZO",
    "displayPartner": false,
    "appSource": null,
    "displayInfo": {
      "default": {
        "descriptionParagraphs": [
          {
            "name": "Short description",
            "content": [
              "Teams Manager helps you keep control of your Microsoft Teams environment by providing Teams templates, an approval workflow, lifecycle management and governance options such as naming conventions."
            ]
          },
          {
            "name": "Long description",
            "content": [
              "\u003Cdiv\u003E\u003Cdiv style=\u0022box-sizing:border-box;\u0022\u003EWith Teams Manager, use any Team as a template and add channels, tabs, lists or apps like Planner and OneNote. Users can then request new Teams based on these templates, which a pre-selected group of users can easily review through an an automated approval workflow.\u003Cbr style=\u0022box-sizing:border-box;\u0022\u003E \u003C/div\u003E\u003Cdiv style=\u0022box-sizing:border-box;\u0022\u003E\u003Cbr style=\u0022box-sizing:border-box;\u0022\u003E \u003C/div\u003E\u003Cdiv style=\u0022box-sizing:border-box;\u0022\u003EFor a better overview in Teams you can create naming conventions and let Teams Manager archive inactive Teams. Build a complete governance automation by combining naming conventions and lifecycle management rules. \u003C/div\u003E\u003Cbr\u003E \u003C/div\u003E"
            ]
          },
          {
            "name": "Business need or problem",
            "content": [
              "With Microsoft Teams, one of the main points of praise and criticismboth is the possibility for every user to create new Teams. While this makes iteasy for employees to engage with the tool and raises the adoption rate, it isalso the source of Teams’ main problem: uncontrolled growth. For each seeminglyimportant topic, users can and will create new Teams. \n\u003Cbr\u003E\n\u003Cbr\u003EThe alternative is to disable the “Create New Team” option for everyonebut the highest-level admins. This setting, however, has serious drawbacks: Userswill be more frustrated with the process, and the adoption rate of Teams as awhole will be reduced accordingly.\n\u003Cbr\u003E\n\u003Cbr\u003EAfter several months of using Teams, even a small company of 10 to 20employees will notice that there are a lot of channels that are used rarely, ifever. A global player with tens of thousands of employees, each of whom cancreate new Teams at will, will quickly lose control over the Teams creationprocess. The result is uncontrolled growth and loss of structure.\n\u003Cbr\u003E\n\u003Cbr\u003ESolutions2Share’s governance tool Teams Manager aims to allow companiesto keep control over their internal structures, while still enabling users tokeep the freedom of creating new Teams according to their needs."
            ]
          },
          {
            "name": "Business solution",
            "content": [
              "Solutions2Share developed Teams Manager as the easiest governance toolfor Microsoft Teams.\n\u003Cbr\u003E\n\u003Cbr\u003ETeams Manager helps companies keep control of their Microsoft Teamsenvironment and stop uncontrolled growth, while still enabling users to requestnew teams based on templates. Any team can be used as a template, withchannels, tabs, lists or apps like Planner and OneNote. Permissions andsettings can also be pre-configured for each template. \n\u003Cbr\u003E\n\u003Cbr\u003ETeams Manager offers an automated request and approval workflow thatallows all users to request new teams (based on templates), while apre-selected group of users can easily review and approve the requests. Foreach new team request, Teams Manager offers the possibility to ask forcustomizable metadata, e.g. the department or cost center. Based on thisinformation, assigned governance policies can then be executed automatically.\n\u003Cbr\u003E\n\u003Cbr\u003EWith lifecycle management, outdated or inactive teams can be archived ordeleted, according to specified expiration dates. The integrated Teams Managerbot keeps team owners informed with automated notifications.\n\u003Cbr\u003E\n\u003Cbr\u003EFor a better overview and structure, Teams Manager allows companies tocreate naming conventions, i.e. predefined words as prefixes or suffixes thatare added to team names, OneNotes or Planners. \n\u003Cbr\u003E\n\u003Cbr\u003ELifecycles and naming conventions can be combined into full governanceautomation with different policies for different templates. \n\u003Cbr\u003E\n\u003Cbr\u003ETeams Manager can be installed directly from the Microsoft Teams app storeand is ready to go in just a few minutes."
            ]
          },
          {
            "name": "Success factors",
            "content": [
              "TeamsManager is the right choice for our clients as it enables them to introducegovernance and still keep their users engaged. Naming conventions for Teamnames, OneNotes and Planners help with sensible names and finding content.Lifecycle settings automatically archive inactive or obsolete Teams. Templatesallow admins to create structures with channels, applications, a unique set ofuser permissions, folder structures and even pre-defined content in Planner andOneNote. Users are able to request new Teams, which approvers check first.\n\u003Cbr\u003E\n\u003Cbr\u003EOurclients\u0027 users save time every day due to a clean, structured Teamsenvironment. They do not have to search any longer for specific content orup-to-date information due to applied naming conventions. The internal ITdepartments are now able to maintain their environment with minimum effort and stillhave a great structure based on their needs and business processes. And mostimportant of all, the users do not need to take additional steps to create anew Team. Our clients are able to safely use Teams as a powerful collaborationtool."
            ]
          }
        ],
        "mediaAssets": [
          {
            "type": "image",
            "order": 0,
            "url": "assets/solutions2share-teams-manager-02-lifecycles.png",
            "alt": ""
          },
          {
            "type": "image",
            "order": 1,
            "url": "assets/solutions2share-teams-manager-01-templates.png",
            "alt": ""
          },
          {
            "type": "image",
            "order": 2,
            "url": "assets/solutions2share-teams-manager-05-create-templates.png",
            "alt": ""
          },
          {
            "type": "image",
            "order": 3,
            "url": "assets/solutions2share-teams-manager-06-requests.png",
            "alt": ""
          },
          {
            "type": "image",
            "order": 4,
            "url": "assets/solutions2share-teams-manager-04-governance-policies.png",
            "alt": ""
          },
          {
            "type": "image",
            "order": 5,
            "url": "assets/solutions2share-teams-manager-03-naming-conventions.png",
            "alt": ""
          },
          {
            "type": "video",
            "order": 6,
            "url": "https://www.youtube.com/embed/EmvGa7JDJr4",
            "alt": ""
          }
        ],
        "detailItemCategories": [
          {
            "name": "Resources",
            "description": "Possible html supported text shown just above the list of links",
            "items": [
              {
                "url": "https://www.solutions2share.com/teams-manager/",
                "name": "https://www.solutions2share.com/teams-manager/"
              },
              {
                "url": "https://www.youtube.com/playlist?list=PLVE_Lp0amIFqwCJrzRtCzNmkgYBjWLv2H",
                "name": "https://www.youtube.com/playlist?list=PLVE_Lp0amIFqwCJrzRtCzNmkgYBjWLv2H"
              },
              {
                "url": "https://www.solutions2share.com/book-a-demo/",
                "name": "https://www.solutions2share.com/book-a-demo/"
              }
            ]
          }
        ]
      }
    }
  }
}