{
  "solutionId": "central-location",
  "partnerId": "sympraxis-consulting",
  "categories": [
    "learningpathways"
  ],
  "industries": [],
  "sortOrder": 0,
  "preview": false,
  "visible": false,
  "solutionLogoPicture": null,
  "solutionLogoPictureAlt": "",
  "solutionName": "Centralized location for all training content",
  "solutionUrl": "https://www.sympraxisconsulting.com",
  "solutionUrlTitle": "Centralized location for all training content",
  "metadata": {
    "personas": "Business Analysts;Content Owners;End-user;IT Admin;Leadership;Training \u0026 Development",
    "businessFunctions": null,
    "displayPartner": false,
    "appSource": null,
    "displayInfo": {
      "default": {
        "descriptionParagraphs": [
          {
            "name": "Short description",
            "content": [
              "An organization can create their own custom training or add training for other technologies outside Microsoft 365. Adding custom training to Learning Pathways creates a one-stop-shop for all training content across the organization."
            ]
          },
          {
            "name": "Long description",
            "content": []
          },
          {
            "name": "Business need or problem",
            "content": [
              "Productivityand collaboration are the heartbeat of any successful organization. \u0026nbsp;To ensure your users are productive, theymust be trained on the tools provided to them and any subsequent updates tothose tools. \u0026nbsp;This is where it getschallenging. \n\u003Cbr\u003E\n\u003Cbr\u003ECompany intranets have become an excellent mediumfor providing internal training for your users. However, decentralized, out-of-date and poorly indexed training content causesfriction and frustration with end-users simply trying to get help on the toolsthey need to do their job."
            ]
          },
          {
            "name": "Business solution",
            "content": [
              "Acentralized and intuitive training portal that supports surfacing the training contentin context enables end users’ability to access the right information at the right time. To identify whatcontent will surface in the training portal, Sympraxis will: \n\u003Cbr\u003E\n\u003Cbr\u003E * \u0026nbsp;Performdiscovery across intranet and external sources for all current trainingmaterials \n\u003Cbr\u003E * \u0026nbsp;Identifysubject matter experts and develop site architecture to support direct accessto content \n\u003Cbr\u003E * \u0026nbsp;Developpersonas for different learners across the organization \n\u003Cbr\u003E * \u0026nbsp;Defineintuitive information architecture to support each persona and their top tasks \n\u003Cbr\u003E * \u0026nbsp;Alignscenarios and playlists with organizational learning objectives \n\u003Cbr\u003E * \u0026nbsp;Collaborate with core learning team tocustomize Learning Pathways homepage"
            ]
          },
          {
            "name": "Success factors",
            "content": [
              "LearningPathways comes with all Microsoft 365 documentation categorized intotechnologies and playlists which is an excellent start for most organizations.Even better, this takes the burden off the Information Technology, learning, ortraining departments to either create or gather this content. Adding organization-specific training to thisportal to create a one-stop shop of all training information supportsproductivity at the organization by: \n\u003Cbr\u003E\n\u003Cbr\u003E * \u0026nbsp;Reducingtime to information\n\u003Cbr\u003E * \u0026nbsp;Creatinglinear training paths across cross-functional training content\n\u003Cbr\u003E * \u0026nbsp;Deliveringtraining to employees in context\n\u003Cbr\u003E * \u0026nbsp;Enabling subjectmatter experts to maintain training content independently"
            ]
          }
        ],
        "mediaAssets": [
          {
            "type": "image",
            "order": 0,
            "url": "assets/Centralized location.png",
            "alt": ""
          }
        ],
        "detailItemCategories": [
          {
            "name": "Resources",
            "description": "Possible html supported text shown just above the list of links",
            "items": []
          }
        ]
      }
    }
  }
}