{
    "solutionId": "orchestry-orchestry",
    "categories": [
        "SOLUTION-CATEGORY01", "SOLUTION-CATEGORY03"
    ],
    "industries": [
        "Cross Industry"
    ],
    "sortOrder": 100,
    "preview": true,
    "visible": false,
    "solutionLogoPicture": "/assets/reach-logo.png",
    "solutionLogoPictureAlt": "Reach",
    "solutionName": "Orchestry",
    "solutionUrl": "https://www.orchestry.com/get-in-touch/",
    "solutionUrlTitle": "Orchestry",
    "metadata": {
        "displayInfo": {
            "default": {
                "descriptionParagraphs": [
                    {
                        "name": "Short Description",
                        "content": [
                            "Orchestry makes work simple in Microsoft 365, Microsoft Teams and SharePoint Online with a comprehensive enablement, adoption and standardization platform that empowers IT Administrators and organizations to define a Microsoft 365 adoption and change management strategy"
                        ]
                    },
                    {
                        "name": "Business need or problem",
                        "content": [
                            "As more organizations standardize on Microsoft Teams as their primary method of communication and collaboration, challenges have begun to surface around:",
                            "<ol>",
                            "<li>What tool to use when:  for a new project, do I set up a Team, SharePoint site, Yammer Community, the list goes on and on…</li>",
                            "<li>Creating a team is either too tightly controlled, creating bottlenecks in productivity OR far too enabled, which creates duplication and sprawl</li>",
                            "<li>Customizing a workspace is too time consuming and challenging for a user – what permissions need to be set, what apps are enabled, etc.</li>",
                            "</ol>",
                            "Orchestry is a balanced platform which simplifies the process of creating a collaboration workspace in Teams, empowers users to ‘self-serve’ (driving usage and adoption of M365) and enables admins to provide valuable insights into how their user base is leveraging M365 to transform the way their organization works."
                        ]
                    },
                    {
                        "name": "Business solution",
                        "content": [
                            "Orchestry developed a solution to simplify the Microsoft265 experience through a balance of adoption tools, engaging templates, controlled provisioning and manicured self-service for end-users, with the following key features:"
                            "<ul>"
                            "<li>Users can quickly request a team leveraging catalog of pre-developed templates</li>"
                            "<li>New employees can browse a directory of ‘workspaces’ available for them to join and start collaboration on a project</li>"
                            "<li>Users easily define the list of owners and admins for the team</li>"
                            "<li>Channels can be auto-created at the time of provisioning</li>"
                            "<li>Additional M365 features are added to the team with ease, such as: Yammer Conversations and SharePoint libraries</li>"
                            "<li>Names are pre-checked to ensure no duplication – there is also a check for ‘like’ names</li>"
                        ]
                    },
                    {
                        "name": "Business value",
                        "content": [
                            "Whether you are just starting with Microsoft Teams or have already deployed and driving usage, Orchestry will help you:"
                            "<ul>"
                            "<li>Reduce cost of provisioning and customizing teams – estimated avg of $6K per team/site</li>"
                            "<li>Reduce the cost of end-user training and adoption tool – estimated avg of $6K</li>"
                            "<li>Lessen time to value with Microsoft Teams by providing out-of-the-box templates and experiences that are easy to use</li>"
                        ]
                    },
                    {
                        "name": "Success Factors",
                        "content": [
                            "From Administrators to End Users, enterprise customers agree that simplifying the provisioning and governance experience through Microsoft Teams drives standardization, user experience and ultimately, adoption. By adopting Orchestry, customers are now able to:"
                            "<ul>"
                            "<li>Create a consistent experience across teams, sites and workspaces</li>"
                            "<li>Drive a consistent governance, provisioning and enablement experience across Microsoft 365 workspaces (Microsoft Teams, SharePoint Site, etc.)</li>"
                            "<li>Manage all workspace requests and provisioning for Microsoft 365 workspaces (teams, sites, etc.) through a single unified interface both for administrators and end users.</li>"
                            "<li>Govern consistent workspace templates, naming policies, metadata and more across both Microsoft Teams and SharePoint Online.</li>"
                            "Customers have deployed Orchestry for core scenarios like Project Management, Change Management (IT), Department Collaboration Workspaces (HR, Communications, Marketing) and more. Customer feedback has been consistent:  Orchestry has become one of the must-have applications for deploying and managing Microsoft Teams."
                        ]
                    },
                    {
                        "name": "Solution Architecture",
                        "content": [
                            "Orchestry is a SASS application built upon Microsoft Azure and leverages many Azure services. These services are grouped together and replicated across many regions including the US, Australia, Europe, and East Asia."
                            "These services include:"
                            "<ul>"
                            "<li>Azure AD Application</li>"
                            "<ul><li>User Authentication: Used to login users against their companies Azure Active Directory into Orchestry.</li>"
                            "<li>App-Only Authentication: Used by the Orchestry app to access a company's Microsoft 365 resources via the Graph and SharePoint APIs.</li></ul>"
                            "<li>App Service</li>"
                            "<ul><li>Web App: The application located at https://app.orchestry.com. The web application is used in both teams and in an admins browser to access Orchestry.</li>"
                            "<li>Orchestry API: Orchestry’s SPA web application leverages the Orchestry API to perform all tasks within the product.</li>"
                            "<li>Teams App: Teams applications and tabs are simply iframe windows into the Web App.</li>"
                            "<li>Backend Processing: When new requests are submitted, they are entered into a queue. This queue is processed, and items are provisioned from the App Service.</li></ul>"
                            "<li>Azure SQL</li>"
                            "<ul><li>Used to store items such as requests, templates, features and configurations.</li>"
                            "<li>Backend processing queue for any client requests.</li></ul>"
                            "<li>App Insights</li>
                            "<ul><li>App Insights are used to monitor the health of our App Services.</li>"
                            "<li>This is also an invaluable tool for identifying and quickly fixing issues that may arise.</li></ul>"
                            "<li>Azure Blog Storage</li>"
                            "<ul><li>Serves as a temporary storage location for files during the provisioning process.</li>"
                            "<li>CDN used for Orchestry web parts and supporting files</li></ul>"
                            "<li>Azure Front Door</li>"
                            "<ul><li>Entry-point into the application that routes users to the lowest latency regional app service for the best Orchestry experience.</li></ul>"
                            "<li>Microsoft Graph API</li>
                            "<ul><li>The app leverages a combination of 15 delegate and application endpoints to perform various tasks within Orchestry.  Some of these tasks are:</li>"
                            "<ul><li>Provision new groups, teams, and sites</li>"
                            "<li>Send notifications to users on various Orchestry events</li>"
                            "<li>Authenticate and login users</li></ul></ul>"
                            "<li>SharePoint API</li>"
                            "<ul><li>The app leverages the SharePoint API to run searches, provision sites, and run Office PnP tasks.</li></ul>"
                            "<li>Microsoft Teams</li>"
                            "<ul><li>Teams App – Orchestry App</li>"
                            "<ul><li>Workspace Request Tab – Used to start a request for a new team or site based on Orchestry configured templates.</li>"
                            "<li>Workspace Directory – The directory surfaces a curated filterable and pageable list of Teams and Sites within a tenant.</li>"
                            "<li>Workspace Provisioning – Once a request has been submitted and approved, Orchestry then provisions the workspace using the requestor’s inputs and Orchestry’s current configuration.</li></ul>
                            "<li>Orchestry Teams Tab</li>"
                            "<ul><li>Team Information Tab – The tab displays information about the current team including links to various resources, owners and members, and custom metadata values from the Orchestry directory.</li>"
                            "<li>Workspace Directory Tab – The directory tab is another way to surface the Workspace Directory that is also available in the Teams App.</li></ul>"
                            "<li>Teams Notifications (Planned)</li>
                            "<ul><li>The notifications provided status updates for a user’s workspace request and lifecycle announcements based on configured criteria.</li></ul>"
                            "<li>Teams Bot (Planned)</li>"
                            "<ul><li>Interactive bot, called Archie, to provide actionable insights based on Teams usage</li></ul></ul>"
                            "<li>SharePoint</li>
                            "<ul><li>Orchestry Site Collection – The app uses this site collection to store workspace directory data and document templates. The site collection’s primary purpose is be used as a storage media for information deemed highly sensitive and that should not live outside of a clients Azure/Microsoft 365 tenant.</li>"
                            "<li>Web Parts – Orchestry comes with a set of SPFX web parts that provide enhanced functionality above and beyond what SharePoint provides out of the box.</li>"
                            "<li>Provisioning – The Orchestry app has the ability to provision new teams, groups, and sites using a current resource as the base template. Orchestry will copy all resources down to the content type from a source team or site into a new team or site.</li></ul>"
                            "</ul>"
                        ]
                    }                                       
                ],
                "mediaAssets": [
                    {
                        "type": "image",
                        "order": 100,
                        "url": "/assets/promo-bot.png",
                        "alt": "Alt text for the image"
                    },
                    {
                        "type": "video",
                        "order": 101,
                        "url": "https://youtube.com/embed/3120470",
                        "alt": "Alt text for the video"
                    }
                ],
                "detailItemCategories": [
                    {
                        "name": "Technologies",
                        "description": "Possible html supported text shown just above the list of links",
                        "items": [
                            {
                                "name": "Bot - link to extensibility look book",
                                "url": "http://aka.ms/m365pnp"
                            },
                            {
                                "name": "SharePoint Framework - link to extensibility look book",
                                "url": "http://aka.ms/m365pnp"
                            }
                        ]
                    },
                    {
                        "name": "Resources",
                        "description": "Possible html supported text shown just above the list of links",
                        "items": [
                            {
                                "name": "Here are some additional references"
                            },
                            {
                                "name": "Additional link",
                                "url": "http://aka.ms/m365pnp"
                            },
                            {
                                "name": "Second additional link",
                                "url": "http://aka.ms/m365pnp"
                            }
                        ]
                    }
                ]
            }
        },
        "fi": {
            "descriptionParagraphs": [
                "Tää on tosi kova tuote mitä kaikkien pitäisi käyttää!"
            ]
        }
    }
}
