{
  "partnerId": "Visualsp",
  "categories": [],
  "industries": [],
  "solutions": null,
  "sortOrder": 0,
  "preview": false,
  "visible": true,
  "logoPicture": null,
  "logoPictureAlt": "",
  "heroPicture": "assets/hero.png",
  "featuredPicture": "https://youtu.be/u9NhplrpLQI",
  "partnerName": "VisualSP",
  "mpnId": "4768963",
  "metadata": {
    "displayInfo": {
      "default": {
        "shortDescription": "\u003Cdiv\u003EVisualSP specializes in providing context sensitive on-screen guidance and learning to your users. The VisualSP Help System cuts down on help desk and training costs by providing step-by-step contextual guidance to your users at their moment of need.\u003Cbr\u003E\u003C/div\u003E",
        "featuredTitle": "Contextual Training Platform for Your Employees",
        "featuredParagraphs": [
          "\u003Cdiv\u003E\u003Cspan style=\u0022display:inline !important;\u0022\u003EThe VisualSP platform currently serves training and guidance in the flow of work to more than 2 million employees around the world. The contextual nature of delivery is helping companies cut down on their support and training costs while satisfying their users with contextual delivery of information within their own environment.\u003C/span\u003E\u003Cbr\u003E \u003C/div\u003E",
          "\u003Cdiv\u003E\u003Cspan style=\u0022display:inline !important;\u0022\u003EVisualSP (Visual Support Platform) ships with over a thousand pre-built and configured Microsoft training items. The system is also fully customizable and configurable to match your business needs with your own custom training content as well. VisualSP is available as an overlay on top of all your enterprise web applications so the information is delivered to your users without leaving their work environment.\u003C/span\u003E\u003Cbr\u003E \u003C/div\u003E",
          "\u003Cdiv\u003E\u003Cspan style=\u0022display:inline !important;\u0022\u003EWhatever app your employee is using, they are able to quickly access on-page training and guidance that shows how they can use the tool most effectively to do their job. For example, whether users are confused about how to set permissions in SharePoint, want to share a Word Online document with peers or cannot remember how to user your company’s leave request application to apply for a leave, VisualSP is always available to help provide them with guidance and training at their moment of their need.\u003C/span\u003E\u003Cbr\u003E \u003C/div\u003E"
        ],
        "callToAction": {
          "title": "Join us at our live product demo",
          "description": "We conduct weekly VisualSP product demos where you can see VisualSP in action and ask your questions. Come join us to see how we can help you achieve your digital adoption goals!",
          "url": "https://www.visualsp.com/visualsp-product-demo/"
        },
        "mediaAssets": [
          {
            "type": "image",
            "order": 0,
            "url": "assets/Hero.png",
            "alt": ""
          }
        ],
        "detailItemCategories": []
      }
    }
  }
}