{
  "partnerId": "clearpeople-limited",
  "categories": [],
  "industries": [],
  "solutions": null,
  "sortOrder": 0,
  "preview": false,
  "visible": true,
  "logoPicture": null,
  "logoPictureAlt": "",
  "heroPicture": "assets/hero.png",
  "featuredPicture": "assets/featured.png",
  "partnerName": "ClearPeople Limited",
  "mpnId": "0",
  "metadata": {
    "displayInfo": {
      "default": {
        "shortDescription": "ClearPeople is the creator ofAtlas, an award-winning digital workspace solution for Microsoft 365.Knowledge, communication and collaboration are brought together beautifully toengage and empower your team, wherever they may be.",
        "featuredTitle": "Atlas Digital Workspace – the only all-in-one platform for Microsoft 365",
        "featuredParagraphs": [
          "Do more with Microsoft 365. Often promised,rarely delivered – until now. Everyone is being asked to do more with less andAtlas is the way to achieve this. Atlas connects knowledge to people quickly,improving productivity and measurably saving time. Quantifiable efficiency,improved outcomes. Every time.",
          "Sell more with Atlas. Yourcustomers need accurate information, quickly. Informed customers mean fastersales cycles. Atlas quickly connects your employees and trusted partners to theinformation your customers need to make informed buying decisions faster. Everytime.",
          "Achieve more. With Atlas your digitaltransformation becomes a more natural process. Open, clear communicationrapidly becomes the standard. Major change is managed and implementedeffectively. Every time."
        ],
        "callToAction": {
          "title": "Connect knowledge to people in the all-in-one platform for Microsoft 365",
          "description": "Start your Atlas Digital Workspace journey and bring knowledge, communication and collaboration together.",
          "url": "https://www.clearpeople.com/atlas"
        },
        "mediaAssets": [
          {
            "type": "image",
            "order": 0,
            "url": "assets/Hero.png",
            "alt": ""
          },
          {
            "type": "image",
            "order": 1,
            "url": "assets/Featured.png",
            "alt": ""
          }
        ],
        "detailItemCategories": []
      }
    }
  }
}