{
  "solutionId": "moyobi",
  "partnerId": "evercom",
  "categories": [
    "teams"
  ],
  "industries": [
    "Cross-Industry"
  ],
  "servicesUsed": [
    "Azure AD",
    "Graph API",
    "Microsoft Teams"
  ],
  "sortOrder": 0,
  "preview": false,
  "visible": true,
  "solutionLogoPicture": null,
  "solutionLogoPictureAlt": "",
  "solutionName": "MoYoBi",
  "solutionUrl": "https://www.evercom.be/services/monitoring-analytics-solution/",
  "solutionUrlTitle": "MoYoBi",
  "metadata": {
    "personas": "DPO;Helpdesk Supervisors;HR;IT Admin;Manager",
    "businessFunctions": null,
    "businessValue": "Microsoft Teams Historical Dashboard solution gives users the option to obtain statistics onauto-attendant / queue / agent performance, such as: answered or missedopportunities, caller experience and promptness in finding a resolution forincoming requests.\n\u003Cbr\u003E\n\u003Cbr\u003EMoYoBi provides dedicatedstatistics and detailed reports to supervise the activity on Call Queues and delivers specializedreports from the Agent’s perspective to monitor their performance and assesstheir efficiency.\n\u003Cbr\u003E\n\u003Cbr\u003EPart of MoYoBi’scapabilities is collecting and processing calls, providing call analytics aswell as a variety of built-in reports for a quick insight into call cost andcall information, enabling chargeback, call quality analysis and cost control.",
    "displayPartner": false,
    "appSource": null,
    "displayInfo": {
      "default": {
        "descriptionParagraphs": [
          {
            "name": "Short description",
            "content": [
              "\u003Cdiv\u003ECloud-based monitoring \u0026amp; call analytics solution for Microsoft Teams. \u003C/div\u003E"
            ]
          },
          {
            "name": "Long description",
            "content": [
              "\u003Cdiv\u003E\u003Cdiv style=\u0022box-sizing:border-box;\u0022\u003EMoYoBi simplifies the way organizations measure Teams usage and savings.\u003Cbr style=\u0022box-sizing:border-box;\u0022\u003E \u003C/div\u003E\u003Cdiv style=\u0022box-sizing:border-box;\u0022\u003E\u003Cbr style=\u0022box-sizing:border-box;\u0022\u003E \u003C/div\u003E\u003Cdiv style=\u0022box-sizing:border-box;\u0022\u003EThat is what makes MoYoBi the perfect business intelligence tool for companies at any size for optimizing and monitoring their Teams communication environment. \u003C/div\u003E \u003C/div\u003E"
            ]
          },
          {
            "name": "Business need or problem",
            "content": [
              "Optimizing the return on anytechnology investment requires understanding its on-going usage and makingadjustments consequently. The comprehensive and varying communications mediatypes available on Teams also require the capability to monitor, analyze andmanage all these resources accordingly.\n\u003Cbr\u003E\n\u003Cbr\u003ETeams customers will require an analyticsand call accounting solution includingreal-time and historical dashboard, traffic analysis, alerting and frauddetection tools."
            ]
          },
          {
            "name": "Business solution",
            "content": [
              "MoYoBi, designed forsmall, medium and large companies through a secured access delivers real operationalbenefits, with powerful features that give the customers visibility and insightinto the Teams Communications.\n\u003Cbr\u003E\n\u003Cbr\u003EPaying as you grow withonly limited investments to start, MoYoBi supports the customer throughout itsmigration process to Teams.\n\u003Cbr\u003E\n\u003Cbr\u003EMoYoBi is intuitive,quick to implement and simplifies the way organizations measure theirTeams usage.\n\u003Cbr\u003E\n\u003Cbr\u003EMoYoBi fits companiesfrom all industries like Financing, Education, Consumer Goods, Healthcare,government, high-tech, travel and transportation and more."
            ]
          },
          {
            "name": "Success factors",
            "content": [
              "With dashboards and reports onTeams usage, MoYoBi has helped our customers to obtain performance metrics and increaseproductivity.\n\u003Cbr\u003E\n\u003Cbr\u003EThemulti-lingual solution allows global deployment within organizations, offeringcontrol of the install and operation of Teams infrastructures, easingconsolidation strategies for all channels."
            ]
          }
        ],
        "mediaAssets": [
          {
            "type": "image",
            "order": 0,
            "url": "assets/MoYoBi-image2.png",
            "alt": ""
          },
          {
            "type": "image",
            "order": 1,
            "url": "assets/MoYoBi-image3.png",
            "alt": ""
          },
          {
            "type": "image",
            "order": 2,
            "url": "assets/MoYoBi-image1.png",
            "alt": ""
          },
          {
            "type": "image",
            "order": 3,
            "url": "assets/MoYoBi-image6.png",
            "alt": ""
          },
          {
            "type": "image",
            "order": 4,
            "url": "assets/MoYoBi-image5.png",
            "alt": ""
          },
          {
            "type": "image",
            "order": 5,
            "url": "assets/MoYoBi-image4.png",
            "alt": ""
          }
        ],
        "detailItemCategories": [
          {
            "name": "Resources",
            "description": "Possible html supported text shown just above the list of links",
            "items": [
              {
                "url": "https://www.evercom.be/services/moyobi/",
                "name": "https://www.evercom.be/services/moyobi/"
              }
            ]
          }
        ]
      }
    }
  }
}