{
  "partnerId": "12345",
  "categories": [],
  "industries": [],
  "solutions": null,
  "sortOrder": 0,
  "preview": true,
  "visible": true,
  "logoPicture": null,
  "logoPictureAlt": "",
  "heroPicture": "assets/hero.png",
  "featuredPicture": "assets/featured.png",
  "partnerName": "TestA",
  "mpnId": "12345",
  "metadata": {
    "displayInfo": {
      "default": {
        "shortDescription": "Partner A",
        "featuredTitle": "Partner A Featuring Solution A",
        "featuredParagraphs": [
          "Testing featured paragraph of Partner A. Testing featured paragraph of Partner A. Testing featured paragraph of Partner A. Testing featured paragraph of Partner A. .Testing featured paragraph of Partner A. Testing featured paragraph of Partner A. Testing featured paragraph of Partner A. Testing featured paragraph of Partner A. Testing featured paragraph of Partner A. Testing featured paragraph of Partner A. Testing featured paragraph of Partner A. Testing featured paragraph of Partner A. Testing",
          "Testing second featured paragraph of Partner A. Testing second featured paragraph of Partner A. Testing second featured paragraph of Partner A.Testing second featured paragraph of Partner A.Testing second featured paragraph of Partner A.Testing second featured paragraph of Partner A.Testing second featured paragraph of Partner A.Testing second featured paragraph of Partner A.Testing second featured paragraph of Partner A.Testing second featured paragraph of Partner A.Testing second featured para",
          "Testing third featured paragraph of Partner A. Testing third featured paragraph of Partner A. Testing third featured paragraph of Partner A. Testing third featured paragraph of Partner A. Testing third featured paragraph of Partner A. Testing third featured paragraph of Partner A. Testing third featured paragraph of Partner A. Testing third featured paragraph of Partner A. Testing third featured paragraph of Partner A. Testing third featured paragraph of Partner A. Testing third featured paragra"
        ],
        "callToAction": {
          "title": "Reach out to us to know more about Partner A",
          "description": "Reach out to us to know more about Partner A. Reach out to us to know more about Partner A .Reach out to us to know more about Partner A .Reach out to us to know more about Partner. Reach out",
          "url": "https://adoption-dev.azurewebsites.net/"
        },
        "mediaAssets": [
          {
            "type": "image",
            "order": 0,
            "url": "assets/Featured.png",
            "alt": ""
          },
          {
            "type": "image",
            "order": 1,
            "url": "assets/Hero.png",
            "alt": ""
          }
        ],
        "detailItemCategories": []
      }
    }
  }
}