{
  "solutionId": "powell-teams",
  "partnerId": "powell-software",
  "categories": [
    "teams"
  ],
  "industries": [
    "Cross-Industry"
  ],
  "servicesUsed": [
    "Azure",
    "Graph API",
    "Microsoft 365",
    "Power Automate"
  ],
  "sortOrder": 0,
  "preview": false,
  "visible": false,
  "solutionLogoPicture": null,
  "solutionLogoPictureAlt": "",
  "solutionName": "Powell Teams",
  "solutionUrl": "https://powell-software.com/en/powell-teams-en/",
  "solutionUrlTitle": "Powell Teams",
  "metadata": {
    "personas": "All Employees;Corporate Communications;HR;IT",
    "businessFunctions": null,
    "businessValue": "Benefits: Employeesgain productivity and agility; By directly integrating all Microsoft 365services and capabilities offered by Microsoft Teams into our Team templates,users take full advantage of all those products that they don\u0027t always know howto use properly and that they sometimes didn\u0027t even know existed: Planner,OneNote, Booking, Forms, Stream, PowerBi, advanced document search, and muchmore. \n\u003Cbr\u003E\n\u003Cbr\u003EReady-to-useteams save considerable time in the execution of day-to-day tasks and \u0026nbsp;promote teamwork by bringing togetherdocumentation, \u0026nbsp;discussions and approvalprocesses related to activities within the same space. \u0026nbsp;\u0026nbsp;It also enables business leaders to ensuregood project governance for documents and access to information. \n\u003Cbr\u003E\n\u003Cbr\u003EPowell Teams optimizes Microsoft Teamsmanagement time by IT teams. IT implements \u0026nbsp;\u0026nbsp;balanced and automatic governance. IT teams can co-build business usesand maximize the adoption of Microsoft Teams and Microsoft 365.",
    "displayPartner": false,
    "appSource": null,
    "displayInfo": {
      "default": {
        "descriptionParagraphs": [
          {
            "name": "Short description",
            "content": [
              "A modern collaboration experience that iseffortless, organized, easy to manage and governed."
            ]
          },
          {
            "name": "Long description",
            "content": []
          },
          {
            "name": "Business need or problem",
            "content": []
          },
          {
            "name": "Business solution",
            "content": [
              "For Employees \n\u003Cbr\u003EPowell Teams enhances the user experience by making it easier for users to access and search for the Microsoft Teams to which they belong. Powell Teams offers \u0026nbsp;an intuitive dashboard to filter Teams based on business criteria. \u0026nbsp;It also helps manage the proliferation of Teams. \n\u003Cbr\u003E \u0026nbsp;\n\u003Cbr\u003EPowell Teams also guides users by offering ready-to-use Teams templates that allow users to create a complete team in 3 clicks. The Team comes loaded with channels, applications and tabs in accordance with the business governance and IT security standards set by the IT team. \n\u003Cbr\u003E\n\u003Cbr\u003EFor IT \n\u003Cbr\u003E \n\u003Cbr\u003EIT teams need to strike the right balance between adopting Microsoft 365 to the business context, making it easy for employees to use, and complying with the rules of security, compliance and good IT management. Powell Teams allows IT to set up an agile and business-oriented governance, defining criteria for each Team template such as: \u0026nbsp;\n\u003Cbr\u003E\n\u003Cbr\u003E * \u0026nbsp;Naming rule and labels\n\u003Cbr\u003E * \u0026nbsp;External or internal, public, or private access rights\n\u003Cbr\u003E * \u0026nbsp;Number of owners and team members\n\u003Cbr\u003E * \u0026nbsp;Expiration and archiving\n\u003Cbr\u003E * \u0026nbsp;Approval process\n\u003Cbr\u003E\n\u003Cbr\u003E \n\u003Cbr\u003EPowell Teams also enables the automation of many of Microsoft Teams\u0027 management tasks: reporting and recurrent review of rules, archiving teams, \u0026nbsp;and improving the creation of teams."
            ]
          },
          {
            "name": "Success factors",
            "content": [
              "The success will come from an agile project management that includes IT professionals for the Governance aspects and Business owners to select which business scenario to start with. While the solution is technically very easy to deploy, most of our customers will include a Microsoft 365 partner to ensure the best adoption by employees of all the selected scenarios."
            ]
          }
        ],
        "mediaAssets": [
          {
            "type": "image",
            "order": 0,
            "url": "assets/sol image 4.png",
            "alt": ""
          },
          {
            "type": "image",
            "order": 1,
            "url": "assets/Sol image 1.png",
            "alt": ""
          },
          {
            "type": "image",
            "order": 2,
            "url": "assets/sol image 5.png",
            "alt": ""
          },
          {
            "type": "image",
            "order": 3,
            "url": "assets/sol image 2.png",
            "alt": ""
          },
          {
            "type": "image",
            "order": 4,
            "url": "assets/sol image 3.png",
            "alt": ""
          },
          {
            "type": "video",
            "order": 5,
            "url": "https://www.youtube.com/embed/J-NMqgTwMYY",
            "alt": ""
          }
        ],
        "detailItemCategories": [
          {
            "name": "Resources",
            "description": "Possible html supported text shown just above the list of links",
            "items": [
              {
                "url": "https://powell-software.com/en/powell-teams-en/",
                "name": "Powell Teams: The Microsoft Teams app for Adoption and Governance (powell-software.com)"
              }
            ]
          }
        ]
      }
    }
  }
}