{
  "partnerId": "cyclotron",
  "categories": [],
  "industries": [],
  "solutions": null,
  "sortOrder": 0,
  "preview": false,
  "visible": true,
  "logoPicture": null,
  "logoPictureAlt": "",
  "heroPicture": "assets/hero.png",
  "featuredPicture": "assets/featured.png",
  "partnerName": "Cyclotron",
  "mpnId": "4480074",
  "metadata": {
    "displayInfo": {
      "default": {
        "shortDescription": "\u003Cdiv\u003E\u003Cspan style=\u0022color:rgb(51, 51, 51);font-family:SegoeUI;font-size:20px;display:inline !important;\u0022\u003EAt Cyclotron, we believe successful engagements stem from our commitment to know our customers worlds; from frameworks to workflows, from compliance to cultures, we work with our customers to make technology work the way the way it’s needed, not the other way around\u003C/span\u003E\u003Cbr\u003E\u003C/div\u003E",
        "featuredTitle": "We’re Cyclotron. We want to welcome you to the new world of an action-oriented, modern technology consultancy.",
        "featuredParagraphs": [
          "\u003Cdiv\u003E\u003Cspan style=\u0022color:rgb(51, 51, 51);font-family:SegoeUI;font-size:16px;display:inline !important;\u0022\u003ECyclotron was proudly founded in San Francisco in 2014 with the sole intent of accelerating the success of our clients by solving mission-critical business and technology challenges, through a proven network of industry-specific frameworks. We’re a trusted Microsoft strategic partner to many innovative organizations in the financial, health and life sciences, public, retail, and technology sectors. Our solutions combined with your investments will boost productivity, enhance collaboration, and integrate intelligence across your entire enterprise.\u003C/span\u003E\u003Cbr\u003E \u003C/div\u003E"
        ],
        "callToAction": {
          "title": "Let\u0027s Connect!",
          "description": "Contact us to learn more about what we do and how Cyclotron can assist you.",
          "url": "https://cyclotrongroup.com/company/contact-us/"
        },
        "mediaAssets": [
          {
            "type": "image",
            "order": 0,
            "url": "assets/Hero.png",
            "alt": ""
          },
          {
            "type": "image",
            "order": 1,
            "url": "assets/Featured.png",
            "alt": ""
          }
        ],
        "detailItemCategories": []
      }
    }
  }
}