{
  "solutionId": "Solution-B",
  "partnerId": "12345",
  "categories": [
    "teams"
  ],
  "industries": [],
  "sortOrder": 0,
  "preview": false,
  "visible": true,
  "solutionLogoPicture": null,
  "solutionLogoPictureAlt": "",
  "solutionName": "Solution B",
  "solutionUrl": "https://adoption-dev.azurewebsites.net/",
  "solutionUrlTitle": "Solution B",
  "metadata": {
    "personas": "Administrators;All Employees;Analyst;Other",
    "solutionTechnologies": "Azure AD B2C;Azure API Management;Azure Translation Services;Custom Tabs;Messaging Extension;Microsoft 365;Other",
    "businessFunctions": "Governance;Human Resources;Project Management",
    "displayPartner": true,
    "appSource": "https://appsource.microsoft.com/",
    "displayInfo": {
      "default": {
        "descriptionParagraphs": [
          {
            "name": "Short description",
            "content": [
              "Solution B long description. Solution B long description.Solution B long description.Solution B long description.Solution B long description.Solution B long description.Solution B long description.Solution B long description.Solution B long description.Solution B long description.Solution B long description.Solution B long description.Solution B long description.Solution B long description.Solution B long description.Solution B long description.Solution B long description.Solution B long descrip"
            ]
          },
          {
            "name": "Long description",
            "content": [
              "Solution B short description. Solution B short description.Solution B short description.Solution B short description.Solution B short description.Solution B short description.Solution B short descript"
            ]
          },
          {
            "name": "Business need or problem",
            "content": [
              "Business needs Solution B. Business needs Solution B. Business needs Solution B. Business needs Solution B. Business needs Solution B. Business needs Solution B. Business needs Solution B. Business needs Solution B. Business needs Solution B. Business needs Solution B. Business needs Solution B. Business needs Solution B. Business needs Solution B. Business needs Solution B. Business needs Solution B. Business needs Solution B. Business needs Solution B. Business needs Solution B. Business needs Solution B. Business needs Solution B. Business needs Solution B. Business needs Solution B. Business needs Solution B. Business needs Solution B. Business needs Solution B. Business needs Solution B. Business needs Solution B. Business needs Solution B. Business needs Solution B. Business needs Solution B. Business needs Solution B. Business needs Solution B. Business needs Solution B. Business needs Solution B. Business needs Solution B. Business needs Solution B. Business needs Solution B. Business needs Solution B. Business needs Solution B. Business needs Solution B. Business needs Solution B. Business needs Solution B. Business needs Solution B. Business needs Solution B. Business needs Solution B. Business needs Solution B. Business needs Solution B. Business needs Solution B. Business needs Solution B. Business needs Solution B. Business needs Solution B. Business needs Solution B. Business needs Solution B. Business needs Solution B. Business needs Solution B. Business needs Solution B. Business needs Solution B. Business needs Solution B. Business needs Solution B. Business needs Solution B. Business needs Solution B. Business needs Solution B. Business needs Solution B. Business needs Solution B. Business needs Solution B. Business needs Solution B. Business needs Solution B. Business needs Solution B. Business needs Solution B. Business needs Solution B. Business needs Solution B. Business needs Solution B. Business needs Solution B. Business needs Solution B. Bu"
            ]
          },
          {
            "name": "Business solution",
            "content": [
              "Business solution Solution B. Business solution Solution B. Business solution Solution B. Business solution Solution B. Business solution Solution B. Business solution Solution B. Business solution Solution B. Business solution Solution B. Business solution Solution B. Business solution Solution B. Business solution Solution B. Business solution Solution B. Business solution Solution B. Business solution Solution B. Business solution Solution B. Business solution Solution B. Business solution Solution B. Business solution Solution B. Business solution Solution B. Business solution Solution B. Business solution Solution B. Business solution Solution B. Business solution Solution B. Business solution Solution B. Business solution Solution B. Business solution Solution B. Business solution Solution B. Business solution Solution B. Business solution Solution B. Business solution Solution B. Business solution Solution B. Business solution Solution B. Business solution Solution B. Business solution Solution B. Business solution Solution B. Business solution Solution B. Business solution Solution B. Business solution Solution B. Business solution Solution B. Business solution Solution B. Business solution Solution B. Business solution Solution B. Business solution Solution B. Business solution Solution B. Business solution Solution B. Business solution Solution B. Business solution Solution B. Business solution Solution B. Business solution Solution B. Business solution Solution B. Business solution Solution B. Business solution Solution B. Business solution Solution B. Business solution Solution B. Business solution Solution B. Business solution Solution B. Business solution Solution B. Business solution Solution B. Business solution Solution B. Business solution Solution B. Business solution Solution B. Business solution Solution B. Business solution Solution B. Business solution Solution B. Business solution Solution B. Business solution Solution B. Business solution So"
            ]
          },
          {
            "name": "Success factors",
            "content": [
              "Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success factors. Success fac"
            ]
          }
        ],
        "mediaAssets": [
          {
            "type": "image",
            "order": 0,
            "url": "assets/Dummy1.jpg",
            "alt": ""
          },
          {
            "type": "image",
            "order": 1,
            "url": "assets/Dummy3.png",
            "alt": ""
          },
          {
            "type": "image",
            "order": 2,
            "url": "assets/Dummy2.jpg",
            "alt": ""
          },
          {
            "type": "image",
            "order": 3,
            "url": "assets/Hero.png",
            "alt": ""
          },
          {
            "type": "video",
            "order": 4,
            "url": "https://www.youtube.com/embed/mx3YwdSDtDU",
            "alt": ""
          }
        ],
        "detailItemCategories": [
          {
            "name": "Resources",
            "description": "Possible html supported text shown just above the list of links",
            "items": []
          }
        ]
      }
    }
  }
}