{
  "partnerId": "opsgility",
  "categories": [],
  "industries": [],
  "solutions": null,
  "sortOrder": 0,
  "preview": false,
  "visible": true,
  "logoPicture": null,
  "logoPictureAlt": "",
  "heroPicture": "assets/Hero.png",
  "featuredPicture": null,
  "partnerName": "Opsgility",
  "mpnId": null,
  "metadata": {
    "displayInfo": {
      "default": {
        "shortDescription": "Opsgility enables organizations to realize thefull potential of the Microsoft cloud through a comprehensive set of servicesand software as a service (SaaS) offerings.",
        "featuredTitle": "Virtual Conference Manager Enterprise Edition",
        "featuredParagraphs": [
          "Audience engagement is a core driver of any conference.Don’t settle for a mundane webinar or recorded video. Deliver engaging digitalevents to thousands of attendees worldwide, with the security and usability ofMicrosoft Teams!",
          "Our platform builds on Teams to automate the creation and organization of Teams Live Events, Teams Meetings, and the 3rd party app ecosystem to create an authentic conference experience. Captivate audiences with a full suite of interactive activities, including an expo hall with sponsored booths, speed networking, mixers, and breakout sessions.",
          "Virtual Conference Manager is more than a meeting platform. It is an end-to-end virtual event solution! Virtual Conference Manager makes it easy for event producers to manage the event from start to finish so that organizers can focus on creating an engaging and memorable experience."
        ],
        "callToAction": {
          "title": "Get Started Today!",
          "description": "Request a free consultation and demo!",
          "url": "https://govirtualconference.com/ContactUs"
        },
        "mediaAssets": [
          {
            "type": "image",
            "order": 0,
            "url": "assets/Hero.png",
            "alt": ""
          }
        ],
        "detailItemCategories": [],
        "contact": null
      }
    }
  }
}